<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="AutoPlay">AutoPlay Policies</string>
      <string id="AutoPlay_Help">Configure various AutoPlay behaviors.</string>
      <string id="NoAutorun">Default behavior for AutoRun</string>
      <string id="NoAutorun_Help">Sets the default behavior for Autorun commands.

Autorun commands are generally stored in autorun.inf files. They often launch the installation program or other routines.

Prior to Windows Vista, when media containing an autorun command is inserted, the system will automatically execute the program without user intervention.

This creates a major security concern as code may be executed without user's knowledge. The default behavior in Windows Vista is to prompt the user whether autorun command is to be run. The autorun command is represented as a handler in the Autoplay dialog.

If you enable this policy, an Administrator can change the default Windows Vista behavior for autorun to:

A) Completely disable autorun commands, or
B) Revert back to Pre-Windows Vista behavior of automatically executing the autorun command.

If you disable or not configure this policy, Windows Vista will prompt the user whether autorun command is to be run.</string>
      <string id="NoAutorun_Disabled">Do not execute any autorun commands</string>
      <string id="NoAutorun_XP">Automatically execute autorun commands</string>
      <string id="DontSetAutoplayCheckbox">Don't set the always do this checkbox</string>
      <string id="DontSetAutoplayCheckbox_Help">If this policy is enabled, the "Always do this..." checkbox in Autoplay dialog will not be set by default when the dialog is shown.</string>
      <string id="NoAutoplayfornonVolume">Turn off Autoplay for non-volume devices</string>
      <string id="NoAutoplayfornonVolume_Help">If this policy is enabled, autoplay will not be enabled for non-volume devices like MTP devices. If you disable or not configure this policy, autoplay will continue to be enabled for non-volume devices.</string> 
      <string id="Autorun">Turn off Autoplay</string>
      <string id="Autorun_Help">Turns off the Autoplay feature.

Autoplay begins reading from a drive as soon as you insert media in the drive. As a result, the setup file of programs and the music on audio media start immediately.

Prior to XP SP2, Autoplay is disabled by default on removable drives, such as the floppy disk drive (but not the CD-ROM drive), and on network drives.

Starting with XP SP2, Autoplay is enabled for removable drives as well, including ZIP drives and some USB Mass Storage devices.

If you enable this setting, you can disable Autoplay on CD-ROM and removable media drives, or disable Autoplay on all drives.

This setting disables Autoplay on additional types of drives. You cannot use this setting to enable Autoplay on drives on which it is disabled by default.

Note: This setting appears in both the Computer Configuration and User Configuration folders. If the settings conflict, the setting in Computer Configuration takes precedence over the setting in User Configuration.</string>
      <string id="Autorun_NoCD">CD-ROM and removable media drives</string>
      <string id="Autorun_None">All drives</string>
    </stringTable>
    <presentationTable>
      <presentation id="NoAutorun">
        <dropdownList refId="NoAutorun_Dropdown" noSort="true" defaultItem="0">Default AutoRun Behavior</dropdownList>
      </presentation>
      <presentation id="Autorun">
        <dropdownList refId="Autorun_Box" defaultItem="0">Turn off Autoplay on:</dropdownList>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
