<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="DisallowCpls">Hide specified Control Panel items</string>
      <string id="DisallowCpls_Help">Hides specified Control Panel items.

This setting removes Control Panel items (such as "Mouse", "System" or "Personalization") from the Control Panel window and the Start menu.

To hide a Control Panel item, click Show. In the Show Contents dialog box in the Value column, enter the Control Panel item's canonical name (e.g. "Microsoft.Mouse", "Microsoft.System" or "Microsoft.Personalization").

Note: For Windows Vista, Windows Server 2008, and earlier versions of Windows, the module name (e.g. "timedate.cpl" or "inetcpl.cpl") should be entered. If a Control Panel item does not have a CPL file, or the CPL file contains multiple applets, then its module name and string resource identification number should be entered (e.g. "@systemcpl.dll,-1" for System or "@themecpl.dll,-1" for Personalization).

A complete list of canonical and module names of Control Panel items can be found in MSDN at http://go.microsoft.com/fwlink/?LinkId=122973.

This setting affects the Start menu and Control Panel window, as well as other ways to access Control Panel items (such as shortcuts in Help and Support or command lines that use control.exe).

If both the "Hide specified Control Panel items" setting and the "Show only specified Control Panel items" setting are enabled, the "Show only specified Control Panel items" setting is ignored.

Note: The Display Control Panel item cannot be hidden in the Desktop context menu by using this setting. To hide the Display Control Panel item and prevent users from modifying the computer's display settings use the "Disable Display Control Panel" setting instead.</string>
      <string id="ForceClassicControlPanel">Always open All Control Panel Items when opening Control Panel</string>
      <string id="ForceClassicControlPanel_Help">Set All Control Panel Items as the default Control Panel view.

If the policy is disabled, Control Panel Home is the default view.</string>
      <string id="NoControlPanel">Prohibit access to the Control Panel</string>
      <string id="NoControlPanel_Help">Disables all Control Panel programs.

This setting prevents Control.exe, the program file for Control Panel, from starting. As a result, users cannot start Control Panel or run any Control Panel items.

This setting also removes Control Panel from the Start menu. This setting also removes the Control Panel folder from Windows Explorer.

If users try to select a Control Panel item from the Properties item on a context menu, a message appears explaining that a setting prevents the action.</string>
      <string id="RestrictCpls">Show only specified Control Panel items</string>
      <string id="RestrictCpls_Help">Hides all Control Panel items and folders except those specified in this setting.

This setting removes all Control Panel items (such as "Mouse", "System" or "Personalization") from the Control Panel window and the Start menu. The only items displayed in Control Panel are those you specify in this setting.

To display a Control Panel item, click Show, In the Show Contents dialog box in the Value column, enter the Control Panel item's canonical name (e.g. "Microsoft.Mouse", "Microsoft.System" or "Microsoft.Personalization").

Note: For Windows Vista, Windows Server 2008, and earlier versions of Windows, the module name (e.g. "timedate.cpl" or "inetcpl.cpl") should be entered. If a Control Panel item does not have a CPL file, or the CPL file contains multiple applets, then its module name and string resource identification number should be entered (e.g. "@systemcpl.dll,-1" for System or "@themecpl.dll,-1" for Personalization).

A complete list of canonical and module names of Control Panel items can be found in MSDN at http://go.microsoft.com/fwlink/?LinkId=122973.

This setting affects the Start menu and Control Panel, as well as other ways to access Control Panel items (such as shortcuts in Help and Support or command lines that use control.exe).

If both the "Hide specified Control Panel items" setting and the "Show only specified Control Panel items" setting are enabled, the "Show only specified Control Panel items" setting is ignored.

Note: The Display Control Panel item cannot be hidden in the Desktop context menu by using this setting. To hide the Display Control Panel item and prevent users from modifying the computer's display settings use the "Disable Display Control Panel" setting instead.</string>
    </stringTable>
    <presentationTable>
      <presentation id="DisallowCpls">
        <listBox refId="DisallowCplsList">List of disallowed Control Panel items</listBox>
      </presentation>
      <presentation id="RestrictCpls">
        <listBox refId="RestrictCplsList">List of allowed Control Panel items</listBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
