<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="Users">User Accounts</string>
      <string id="Users_Help">Contains settings to control the behavior of User Accounts</string>
      <string id="UseDefaultTile">Apply the default user logon picture to all users</string>
      <string id="UseDefaultTile_Help">This policy setting allows an administrator to standardize the logon pictures for all users on a system to the default user picture. One application for this policy setting is to standardize the logon pictures to a company logo.

Note: The default user picture is stored at %PROGRAMDATA%\Microsoft\User Account Pictures\user.bmp. The default guest picture is stored at %PROGRAMDATA%\Microsoft\User Account Pictures\guest.bmp. If the default pictures do not exist, an empty frame is displayed.

If you enable this policy setting, the default user logon picture will display for all users on the system with no customization allowed.

If you disable or do not configure this policy setting, users will be able to customize their logon pictures.</string>
    
    </stringTable>
  </resources>
</policyDefinitionResources>
