<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="DefaultLogonDomain">Assign a default domain for logon</string>
      <string id="DefaultLogonDomain_Help">This policy setting specifies a default logon domain which may be a different domain than the machine joined domain. Without this policy, at logon, if a user does not specify a domain for logon, the domain to which the machine belongs is assumed as the default domain. For example if the machine belongs to the Fabrikam domain, the default domain for user logon is Fabrikam.

If you enable this policy setting, the a default logon domain will be set to the specified domain which may not be the machine joined domain.

If you disable or do not configure  this policy setting, the default logon domain will always be set to the machine joined domain.</string>
      <string id="ExcludedCredentialProviders">Exclude credential providers</string>
      <string id="ExcludedCredentialProviders_Help">This policy setting allows the administrator to exclude the specified
credential providers from use during authentication.

Note: credential providers are used to process and validate user
credentials during logon or when authentication is required.
Windows Vista provides two default credential providers:
Password and Smart Card. An administrator can install additional
credential providers for different sets of credentials
(for example, to support biometric authentication).

If you enable this policy, an administrator can specify the CLSIDs
of the credential providers to exclude from the set of installed
credential providers available for authentication purposes.

If you disable or do not configure this policy, all installed credential providers will be available for authentication purposes.</string>
      <string id="Logon">Logon</string>
    </stringTable>
    <presentationTable>
      <presentation id="DefaultLogonDomain">
        <textBox refId="DefaultLogonDomain_Message">
          <label>Default Logon domain:</label>
        </textBox>
        <text>Enter the name of the domain</text>
      </presentation>
      <presentation id="ExcludedCredentialProviders">
        <textBox refId="ExcludedCredentialProviders_Message">
          <label>Exclude the following credential providers:</label>
        </textBox>
        <text>Enter the comma-separated CLSIDs for multiple credential providers
to be excluded from use during authentication.

For example: {ba0dd1d5-9754-4ba3-973c-40dce7901283},{383f1aa4-65dd-45bc-9f5a-ddd2f222f07d}</text>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
