<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="CADOptions">Ctrl+Alt+Del Options</string>
      <string id="DisableChangePassword">Remove Change Password</string>
      <string id="DisableChangePassword_Help">Prevents users from changing their Windows password on demand.

This setting disables the "Change Password" button on the Windows Security dialog box (which appears when you press Ctrl+Alt+Del).

However, users are still able to change their password when prompted by the system. The system prompts users for a new password when an administrator requires a new password or their password is expiring.</string>
      <string id="DisableLockComputer">Remove Lock Computer</string>
      <string id="DisableLockComputer_Help">Prevents users from locking the system.

While locked, the desktop is hidden and the system cannot be used. Only the user who locked the system or the system administrator can unlock it.

Tip:To lock a computer without configuring a setting, press Ctrl+Alt+Delete, and then click "Lock Computer."</string>
      <string id="DisableTaskMgr">Remove Task Manager</string>
      <string id="DisableTaskMgr_Help">Prevents users from starting Task Manager (Taskmgr.exe).

If this setting is enabled and users try to start Task Manager, a message appears explaining that a policy prevents the action.

Task Manager lets users start and stop programs; monitor the performance of their computers; view and monitor all programs running on their computers, including system services; find the executable names of programs; and change the priority of the process in which programs run.</string>
      <string id="NoLogoff">Remove Logoff</string>
      <string id="NoLogOff_Help">This setting disables or removes all menu items and buttons that log the user off the system.

Also, see the "Remove Logoff on the Start Menu" setting.</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
