<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="DFSDiscoverDC">Sets how often a DFS Client discovers DC's</string>
      <string id="DFSDiscoverDC_Help">Allows you to configure how often a Distributed File System (DFS) client attempts to discover domain controllers on their network.

By default, a DFS client attempts to discover domain controllers every 15 minutes.

If you enable this setting, you can configure how often a DFS client attempts to discover domain controllers. This value is specified in minutes.

If you disable this setting or do not configure it, the default value of 15 minutes applies.

Note: The minimum value you can select is 15 minutes. If you try to set this setting to a value less then 15 minutes, the default value of 15 minutes is applied.</string>
    </stringTable>
    <presentationTable>
      <presentation id="DFSDiscoverDC">
        <decimalTextBox refId="DFSDiscoverDialog" defaultValue="15">Time in minutes:</decimalTextBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
