<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="CAT_DesktopWindowManager">Desktop Window Manager</string>
      <string id="CAT_DesktopWindowManagerColorization">Window Frame Coloring</string>
      <string id="DwmDefaultColorizationColor">Specify a default color</string>
      <string id="DwmDefaultColorizationColorExplain">This policy setting controls the default color for window frames when the user does not specify a color.

If you enable this policy setting and specify a default color, this color will be used in glass window frames, if the user has not specified a color.

If you disable or do not configure this policy setting, the default internal color will be used, if the user has not specified a color.

Note: This policy setting can be used in conjunction with the, "Prevent color changes of window frames" setting, to enforce a specific color for window frames that cannot be changed by users.</string>
      <string id="DwmDisallowAnimations">Do not allow window animations</string>
      <string id="DwmDisallowAnimationsExplain">This policy setting controls the appearance of window animations such as those found when restoring, minimizing, and maximizing windows.

If you enable this setting, window animations will be turned off.

If you disable or do not configure this setting, window animations will be turned on.

Changing this setting will require a logoff for it to be applied.</string>
      <string id="DwmDisallowColorizationColorChanges">Do not allow color changes</string>
      <string id="DwmDisallowColorizationColorChangesExplain">This policy setting controls the ability to change the color of window frames.

If you enable this policy setting, you prevent users from changing the default window frame color.

If you disable or do not configure this policy setting, you allow users to change the default window frame color.

Note: This setting can be used in conjunction with the "Specify a default color for window frames" setting, to enforce a specific color for window frames that cannot be changed by users.</string>
      <string id="DwmDisallowComposition">Do not allow desktop composition</string>
      <string id="DwmDisallowCompositionExplain">This policy setting controls how some graphics are rendered and facilitates other features, including Flip, Flip3D, and Taskbar Thumbnails.

If you enable this setting, the desktop compositor visual experience will be turned off.

If you disable or do not configure this policy setting, desktop composition will be turned on, if the required hardware is in place.

Changing this setting will require a logoff for it to be applied.</string>
      <string id="DwmDisallowFlip3D">Do not allow Flip3D invocation</string>
      <string id="DwmDisallowFlip3DExplain">Flip3D is a 3D window switcher.

If you enable this setting, Flip3D will be inaccessible.

If you disable or do not configure this policy setting, Flip3D will be accessible, if desktop composition is turned on.

Changing this setting will require a logoff for it to be applied.</string>
    </stringTable>
    <presentationTable>
      <presentation id="DwmDefaultColorizationColor_1">
        <decimalTextBox refId="DwmDefaultColorizationColorAlpha">Alpha</decimalTextBox>
        <decimalTextBox refId="DwmDefaultColorizationColorRed">Red</decimalTextBox>
        <decimalTextBox refId="DwmDefaultColorizationColorGreen">Green</decimalTextBox>
        <decimalTextBox refId="DwmDefaultColorizationColorBlue">Blue</decimalTextBox>
      </presentation>
      <presentation id="DwmDefaultColorizationColor_2">
        <decimalTextBox refId="DwmDefaultColorizationColorAlpha">Alpha</decimalTextBox>
        <decimalTextBox refId="DwmDefaultColorizationColorRed">Red</decimalTextBox>
        <decimalTextBox refId="DwmDefaultColorizationColorGreen">Green</decimalTextBox>
        <decimalTextBox refId="DwmDefaultColorizationColorBlue">Blue</decimalTextBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
