<?xml version="1.0"?>
<policyDefinitionResources revision="1.0" schemaVersion="1.0">
	<displayName>Event Forwarding</displayName>

	<description>Policy Definitions For Event Forwarding</description>

	<resources>

		<stringTable>

			<string id="EventForwarding">Event Forwarding</string>

                        <string id="ForwarderResourceUsage">ForwarderResourceUsage</string>
                        <string id="ForwarderResourceUsage_Help">Controls resource usage for the forwarder.   Each setting applies across all subscriptions for the forwarder.</string>
 
			<string id="SubscriptionManager">Configure the server address, refresh interval, and issuer certificate authority of a target Subscription Manager</string>

			<string id="Subscription_Help">This policy setting allows you to configure the server address, refresh interval, and issuer certificate authority (CA) of a target Subscription Manager. The Subscription Manager is the computer to which events are forwarded.

Syntax: Option=Value[,Option=Value]*
Options:
Server (mandatory) - Address of the computer to which events should be forwarded. When the server uses the default transport protocol (HTTP) and port (5985), use "Server=&lt;FQDN&gt;" where &lt;FQDN&gt; is the fully qualified domain name of the server. Otherwise, specify the full URL. For example, when using the HTTPS protocol, "Server=https://&lt;FQDN&gt;:5986/wsman/SubscriptionManager/WEC"
</string>

			<string id="SubscriptionManager_Listbox">SubscriptionManagers</string>
		</stringTable>

	
		<presentationTable>

			<presentation id="SubscriptionManager">
                                
				<listBox refId="SubscriptionManager_Listbox">SubscriptionManagers</listBox>

			</presentation>

                        <presentation id="ForwarderResourceUsage">

                                <decimalTextBox refId="MaxForwardingRate" spinStep="100">The maximum forwarding rate ( events/sec ) allowed for the forwarder: </decimalTextBox>

                        </presentation>

		</presentationTable>

	</resources>

</policyDefinitionResources>
