<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="CustomLocalesNoSelect">Disallow selection of Custom Locales</string>
      <string id="CustomLocalesNoSelect_Help">This policy prevents a user from selecting a supplemental custom locale as their user locale. The user is restricted to the set of locales that shipped with the operating system.

Note that this does not affect the selection of replacement locales. To prevent the selection of replacement locales, adjust the permissions of the %windir%\Globalization directory to prevent the installation of locales by unauthorized users.

Note that "Restrict user locales" can also be enabled to disallow selection of a custom locale, even if this policy is not configured.

If this policy is Enabled, then the user cannot select a custom locale as their user locale, but they may still select a replacement locale if one is installed.

If the policy is Disabled or Not Configured, then the user may select a custom locale as their user locale.

If this policy is Enabled at the Machine level, it cannot be disabled by a per-User policy. If this policy is Disabled at the Machine level, then the per-User policy will be ignored. If this policy is Not Configured at the machine level, then restrictions will be based on per-User policies.

To set this policy on a per-user basis, make sure that the per-machine policy is set to Not Configured.

</string>
      <string id="HideAdminOptions">Hide Regional and Language Options administrative options</string>
      <string id="HideAdminOptions_Help">This policy removes the Administrative options from the Regional and Language Options control panel.  Administrative options include interfaces for setting system locale and copying settings to the default user. This policy does not, however, prevent an administrator or another application from changing these values programmatically.

The policy is used only to simplify the Regional Options control panel.

If the policy is Enabled, then the user will not be able to see the Administrative options.

If the policy is Disabled or Not Configured, then the user will see the Administrative options.

Note that even if a user can see the Administrative options, other policies may prevent them from modifying the values.</string>
      <string id="HideCurrentLocation">Hide the geographic location option</string>
      <string id="HideCurrentLocation_Help">This policy removes the option to change the user's geographical location (GeoID) from the Language and Regional Options control panel. This does not, however, prevent the user or an application from changing the GeoID programmatically.

The policy is used only to simplify the Regional Options control panel.

If the policy is Enabled, then the user will not see the option to change the user geographical location (GeoID).

If the policy is Disabled or Not Configured, then the user will see the option for changing the user location (GeoID).

Note that even if a user can see the GeoID Option, the "Disallow changing of geographical location" option may prevent them from actually changing their current geographical location.</string>
      <string id="HideLanguageSelection">Hide the select language group options</string>
      <string id="HideLanguageSelection_Help">This policy removes the option to change the user's menus and dialogs (UI) language from the Language and Regional Options control panel.  This does not, however, prevent the user or an application from changing the UI language programmatically.

The policy is used only to simplify the Regional Options control panel.

If the policy is Enabled, then the user will not see the option for changing the UI language.

If the policy is Disabled or Not Configured, then the user will see the option for changing the UI language.

Note that even if a user can see the option to change the UI language, other policies may prevent them from changing their UI language.</string>
      <string id="HideLocaleSelectAndCustomize">Hide user locale selection and customization options</string>
      <string id="HideLocaleSelectAndCustomize_Help">This policy removes the regional formats interface from the Regional and Language Options control panel.  This does not, however, prevent the user or an application from changing their user locale or user overrides programmatically.

The policy is only used to simplify the Regional Options control panel.

If the policy is Enabled, then the user will not see the regional formats options.

If the policy is Disabled or Not Configured, then the user will see the regional formats options for changing and customizing the user locale.</string>
      <string id="LocaleSystemRestrict">Restrict system locales</string>
      <string id="LocaleSystemRestrict_Help">This policy restricts the permitted system locales to the specified list. If the list is empty, it locks the system locale to its current value. This policy does not change the existing system locale; however, the next time that an admin attempts to change the machine's system locale they will be restricted to the specified list.

The locale list is specified using language names, separated by a semi-colon (;). For example, en-US is English (United States).  Specifying "en-US;en-CA" would restrict the system locale to English (United States) and English (Canada).

If this policy is Enabled, then administrators may select a system locale only from the specified system locale list.

If this policy is Disabled or Not Configured, then administrators may select any system locale shipped with the operating system.</string>
      <string id="LocaleUserRestrict">Restrict user locales</string>
      <string id="LocaleUserRestrict_Help">This policy restricts users on a machine to the specified list of user locales. If the list is empty, it locks all user locales to their current values. This policy does not change existing user locale settings; however, the next time a user attempts to change their user locale, their choices will be restricted to locales in this list.

To set this policy on a per-user basis, make sure that the per-machine policy is set to not configured.

The locale list is specified using language tags, separated by a semicolon (;). For example, en-US is English (United States).  Specifying "en-CA;fr-CA" would restrict the user locale to English (Canada) and French (Canada).

If this policy is Enabled, then only locales in the specified locale list may be selected by users.

If this policy is Disabled or Not Configured, then users may select any locale installed on the machine, unless restricted by the "Disallow selection of Custom Locales" policy.

If this policy is Enabled at the machine level, it cannot be disabled by a per-user policy. If this policy is disabled at the machine level, then the per-user policy will be ignored. If this policy is not configured at the machine level, then restrictions will be based on per-user policies.

Note that if an administrator has enabled the "Disallow selection of Custom Locales" policy, then users will be prevented from selecting supplemental custom locales, even if they are in the specified locale list for this policy.
</string>
      <string id="LockMachineUILanguage">Restricts the UI language Windows uses for all logged users</string>
      <string id="LockMachineUILanguage_Help">This is a setting for computers with more than one UI language installed. If you enable this setting the UI language of Windows menus and dialogs language for systems with more than one language is restricted to the specific language. If the specified language is not installed on the target computer or the policy is disabled, the language selection defaults to the language selected by the local administrator.</string>
      <string id="LockUserUILanguage">Restricts the UI languages Windows should use for the selected user</string>
      <string id="LockUserUILanguage_Help">This is a setting for computers with more than one UI language installed. If you enable this setting the UI language of Windows menus and dialogs language for systems with more than one language is restricted to the specific language for the selected user. If the specified language is not installed on the target computer or the policy is disabled, the language selection defaults to the language selected by the user.

To enable this policy in Windows 2000, Windows XP or Windows Server 2003, you need to use "Restrict selection of Windows menus and dialogs language" policy. 

</string>
      <string id="MachineUILanguageOverwrite">Force selected system UI language to overwrite the user UI language</string>
      <string id="MachineUILanguageOverwrite_Help">This is a setting for computers with more than one UI language installed. If you enable this setting, the UI language of Windows menus and dialogs language for systems with more than one language will follow the language specified by the administrator as the system UI languages.  The user UI language will be ignored.</string>
      <string id="NlsManagementCat">Locale Services</string>
      <string id="PreventGeoIdChange">Disallow changing of geographic location</string>
      <string id="PreventGeoIdChange_Help">This policy prevents users from changing their user geographical location (GeoID).

If this policy is Enabled, then the user cannot change their geographical location (GeoID)

If the policy is Disabled or Not Configured, then the user may select any GeoID.

If this policy is Enabled at the Machine level, then it cannot be disabled by a per-User policy. If this policy is Disabled at the Machine level, then the per-User policy will be ignored. If this policy is Not Configured at the machine level, then restrictions will be based on per-User policies.

To set this policy on a per-user basis, make sure that the per-machine policy is set to Not Configured.</string>
      <string id="PreventUserOverrides">Disallow user override of locale settings</string>
      <string id="PreventUserOverrides_Help">This policy prevents the user from customizing their locale by changing their user overrides.

Any existing overrides in place when this policy is enabled will be frozen. To remove existing user overrides, first reset the user(s) values to the defaults and then apply this policy.

When this policy is enabled, users may still choose alternate locales installed on the system unless prevented by other policies, however they will be unable to customize those choices.

If this policy is Enabled, then the user cannot customize their user locale with user overrides.

If this policy is Disabled or Not Configured, then the user can customize their user locale overrides.

If this policy is Enabled at the Machine level, then it cannot be disabled by a per-User policy. If this policy is Disabled at the Machine level, then the per-User policy will be ignored. If this policy is Not Configured at the machine level, then restrictions will be based on per-User policies.

To set this policy on a per-user basis, make sure that the per-machine policy is set to Not Configured.</string>
      <string id="RegionalOptions">Regional and Language Options</string>
      <string id="RestrictUILangSelect">Restrict selection of Windows menus and dialogs language</string>
      <string id="RestrictUILangSelect_Help">This setting restricts users to the specified language by disabling the menus and dialog box controls in the Regional and Language Options Control Panel. If the specified language is not installed on the target computer, the language selection defaults to English.

To enable this policy in Windows Vista, you need to use "Restricts the UI languages Windows should use for the selected user" policy. 
</string>
      <string id="UILang1">English</string>
      <string id="UILang10">Swedish</string>
      <string id="UILang11">Dutch</string>
      <string id="UILang12">Portuguese (Brazil)</string>
      <string id="UILang13">Finnish</string>
      <string id="UILang14">Norwegian</string>
      <string id="UILang15">Danish</string>
      <string id="UILang16">Hungarian</string>
      <string id="UILang17">Polish</string>
      <string id="UILang18">Russian</string>
      <string id="UILang19">Czech</string>
      <string id="UILang2">Japanese</string>
      <string id="UILang20">Greek</string>
      <string id="UILang21">Portuguese (Portugal)</string>
      <string id="UILang22">Turkish</string>
      <string id="UILang23">Arabic</string>
      <string id="UILang24">Hebrew</string>
      <string id="UILang25">Slovak</string>
      <string id="UILang26">Slovenian</string>
      <string id="UILang27">Romanian</string>
      <string id="UILang28">Croatian</string>
      <string id="UILang29">Bulgarian</string>
      <string id="UILang3">Korean</string>
      <string id="UILang30">Estonian</string>
      <string id="UILang31">Lithuanian</string>
      <string id="UILang32">Latvian</string>
      <string id="UILang33">Thai</string>
      <string id="UILang4">German</string>
      <string id="UILang5">Simplified Chinese</string>
      <string id="UILang6">Traditional Chinese</string>
      <string id="UILang34">Traditional Chinese (Hong Kong)</string>
      <string id="UILang35">Traditional Chinese (Taiwan)</string>
      <string id="UILang7">French</string>
      <string id="UILang8">Spanish</string>
      <string id="UILang9">Italian</string>
      <string id="UILang36">Serbian (Latin)</string>
      <string id="UILang37">Ukrainian</string>
      <string id="Y2K">Century interpretation for Year 2000</string>
      <string id="Y2K_Help">Determines how programs interpret two-digit years.

This setting specifies the largest two-digit year interpreted as being preceded by 20. All numbers less than or equal to the specified value are interpreted as being preceded by 20. All numbers greater than the specified value are interpreted as being preceded by 19.

For example, the default value, 2029, specifies that all two-digit years less than or equal to 29 (00 to 29) are interpreted as being preceded by 20, that is 2000 to 2029. Conversely, all two-digit years greater than 29 (30 to 99) are interpreted as being preceded by 19, that is, 1930 to 1999.

This setting only affects the programs that use this Windows feature to interpret two-digit years. If a program does not interpret two-digit years correctly, consult the documentation or manufacturer of the program.</string>
    </stringTable>
    <presentationTable>
      <presentation id="LocaleSystemRestrict">
        <text>These systems are restricted to the following locale(s)</text>
        <text>The expected form is en-US;fr-FR</text>
        <textBox refId="AllowableSystemLocaleTagList">
          <label>System Locales</label>
        </textBox>
      </presentation>
      <presentation id="LocaleUserRestrict_1">
        <text>The user is restricted to using the following locale(s)</text>
        <text>The expected form is en-US;fr-FR</text>
        <textBox refId="AllowableUserLocaleTagList">
          <label>User Locales</label>
        </textBox>
      </presentation>
      <presentation id="LocaleUserRestrict_2">
        <text>The user is restricted to using the following locale(s)</text>
        <text>The expected form is en-US;fr-FR</text>
        <textBox refId="AllowableUserLocaleTagList">
          <label>User Locales</label>
        </textBox>
      </presentation>
      <presentation id="LockMachineUILanguage">
        <dropdownList refId="UILangSelect" noSort="true" defaultItem="0">Restrict users to the following language:</dropdownList>
      </presentation>
      <presentation id="LockUserUILanguage">
        <dropdownList refId="UILangSelect" noSort="true" defaultItem="0">Restrict users to the following language:</dropdownList>
      </presentation>
      <presentation id="RestrictUILangSelect">
        <dropdownList refId="UILangSelect" noSort="true" defaultItem="0">Restrict users to the following language:</dropdownList>
      </presentation>
      <presentation id="Y2K">
        <text>Specify the maximum year for which two-digit years are interpreted as being 21st century:</text>
        <decimalTextBox refId="Y2KYear" defaultValue="2029">Year </decimalTextBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
