<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="DisableLGPOProcessing">Turn off Local Group Policy objects processing</string>
      <string id="DisableLGPOProcessing_Help">This policy setting prevents Local Group Policy objects (Local GPOs) from being applied.

By default, the policy settings in Local GPOs are applied before any domain-based GPO policy settings. These policy settings can apply to both users and the local computer. You can disable the processing and application of all Local GPOs to ensure that only domain-based GPOs are applied.

If you enable this policy setting, the system will not process and apply any Local GPOs.

If you disable or do not configure this policy setting, Local GPOs will continue to be applied.

Note:  For computers joined to a domain, it is strongly recommended that you only configure this policy setting  in domain-based GPOs.  This setting will be ignored on computers that are joined to a workgroup.
</string>
      <string id="SyncWaitTime">Startup policy processing wait time</string>
      <string id="SyncWaitTime_Help">This policy setting specifies how long Group Policy should wait for network availability notifications during startup policy processing. If the startup policy processing is synchronous, the computer is blocked until the network is available or the default wait time is reached. If the startup policy processing is asynchronous, the computer is not blocked and policy processing will occur in the background. In either case, configuring this policy setting overrides any system-computed wait times.

If you enable this policy setting, Group Policy will use this administratively configured maximum wait time and override any default or system-computed wait time.

If you disable or do not configure this policy setting, Group Policy will use the default wait time of 30 seconds on computers running Windows Vista operating system. 
</string>

      <string id="AllowX-ForestPolicy-and-RUP">Allow Cross-Forest User Policy and Roaming User Profiles</string>
      <string id="AllowX-ForestPolicy-and-RUP_Help">Allows user-based policy processing, roaming user profiles, and user object logon scripts for interactive logons across forests.

This setting affects all user accounts that interactively log on to a computer in a different forest when a trust across forests or a two-way forest trust exists.

When this setting is not configured:
-  No user-based policy settings are applied from the user's forest
-  Users do not receive their roaming profiles; they receive a local profile on the computer from the local forest. A warning message appears to the user, and an event log message (1529) is posted.
-  Loopback Group Policy processing is applied, using the Group Policy objects (GPOs) that are scoped to the computer.
- An event log message (1109) is posted, stating that loopback was invoked in Replace mode.

When this setting is enabled, the behavior is exactly the same as in Windows 2000: user policy is applied, and a roaming user profile is allowed from the trusted forest.

When this setting is disabled, the behavior is the same as if it is not configured.</string>
      <string id="CSE_AppMgmt">Software Installation policy processing</string>
      <string id="CSE_AppMgmt_Help">Determines when software installation policies are updated.

This setting affects all policies that use the software installation component of Group Policy, such as policies in Software Settings\Software Installation. You can set software installation policy only for Group Policy objects stored in Active Directory, not for Group Policy objects on the local computer.

This policy overrides customized settings that the program implementing the software installation policy set when it was installed.

If you enable this setting, you can use the check boxes provided to change the options. If you disable this setting or do not configure it, it has no effect on the system.

The "Allow processing across a slow network connection" option updates the policies even when the update is being transmitted across a slow network connection, such as a telephone line. Updates across slow connections can cause significant delays.

The "Process even if the Group Policy objects have not changed" option updates and reapplies the policies even if the policies have not changed. Many policy implementations specify that they are updated only when changed. However, you might want to update unchanged policies, such as reapplying a desired setting in case a user has changed it.</string>
      <string id="CSE_DiskQuota">Disk Quota policy processing</string>
      <string id="CSE_DiskQuota_Help">Determines when disk quota policies are updated.

This setting affects all policies that use the disk quota component of Group Policy, such as those in Computer Configuration\Administrative Templates\System\Disk Quotas.

It overrides customized settings that the program implementing the disk quota policy set when it was installed.

If you enable this setting, you can use the check boxes provided to change the options. If you disable this setting or do not configure it, it has no effect on the system.

The "Allow processing across a slow network connection" option updates the policies even when the update is being transmitted across a slow network connection, such as a telephone line. Updates across slow connections can cause significant delays.

The "Do not apply during periodic background processing" option prevents the system from updating affected policies in the background while the computer is in use. When background updates are disabled, policy changes will not take effect until the next user logon or system restart.

The "Process even if the Group Policy objects have not changed" option updates and reapplies the policies even if the policies have not changed. Many policy implementations specify that they are updated only when changed. However, you might want to update unchanged policies, such as reapplying a desired setting in case a user has changed it.</string>
      <string id="CSE_EFSRecovery">EFS recovery policy processing</string>
      <string id="CSE_EFSRecovery_Help">Determines when encryption policies are updated.

This setting affects all policies that use the encryption component of Group Policy, such as policies related to encryption in Windows Settings\Security Settings.

It overrides customized settings that the program implementing the encryption policy set when it was installed.

If you enable this setting, you can use the check boxes provided to change the options. If you disable this setting or do not configure it, it has no effect on the system.

The "Allow processing across a slow network connection" option updates the policies even when the update is being transmitted across a slow network connection, such as a telephone line. Updates across slow connections can cause significant delays.

The "Do not apply during periodic background processing" option prevents the system from updating affected policies in the background while the computer is in use. When background updates are disabled, policy changes will not take effect until the next user logon or system restart.

The "Process even if the Group Policy objects have not changed" option updates and reapplies the policies even if the policies have not changed. Many policy implementations specify that they are updated only when changed. However, you might want to update unchanged policies, such as reapplying a desired setting in case a user has changed it.</string>
      <string id="CSE_FolderRedirection">Folder Redirection policy processing</string>
      <string id="CSE_FolderRedirection_Help">Determines when folder redirection policies are updated.

This setting affects all policies that use the folder redirection component of Group Policy, such as those in WindowsSettings\Folder Redirection. You can only set folder redirection policy for Group Policy objects, stored in Active Directory, not for Group Policy objects on the local computer.

This setting overrides customized settings that the program implementing the folder redirection policy set when it was installed.

If you enable this setting, you can use the check boxes provided to change the options. If you disable this setting or do not configure it, it has no effect on the system.

The "Allow processing across a slow network connection" option updates the policies even when the update is being transmitted across a slow network connection, such as a telephone line. Updates across slow connections can cause significant delays.

The "Process even if the Group Policy objects have not changed" option updates and reapplies the policies even if the policies have not changed. Many policy implementations specify that they are updated only when changed. However, you might want to update unchanged policies, such as reapplying a desired setting in case a user has changed it.</string>
      <string id="CSE_IEM">Internet Explorer Maintenance policy processing</string>
      <string id="CSE_IEM_Help">Determines when Internet Explorer Maintenance policies are updated.

This setting affects all policies that use the Internet Explorer Maintenance component of Group Policy, such as those in Windows Settings\Internet Explorer Maintenance.

It overrides customized settings that the program implementing the Internet Explorer Maintenance policy set when it was installed.

If you enable this setting, you can use the check boxes provided to change the options. If you disable this setting or do not configure it, it has no effect on the system.

The "Allow processing across a slow network connection" option updates the policies even when the update is being transmitted across a slow network connection, such as a telephone line. Updates across slow connections can cause significant delays.

The "Do not apply during periodic background processing" option prevents the system from updating affected policies in the background while the computer is in use. When background updates are disabled, policy changes will not take effect until the next user logon or system restart.

The "Process even if the Group Policy objects have not changed" option updates and reapplies the policies even if the policies have not changed. Many policy implementations specify that they are updated only when changed. However, you might want to update unchanged policies, such as reapplying a desired setting in case a user has changed it.</string>
      <string id="CSE_IPSecurity">IP Security policy processing</string>
      <string id="CSE_IPSecurity_Help">Determines when IP security policies are updated.

This setting affects all policies that use the IP security component of Group Policy, such as policies in Computer Configuration\Windows Settings\Security Settings\IP Security Policies on Local Machine.

It overrides customized settings that the program implementing the IP security policy set when it was installed.

If you enable this setting, you can use the check boxes provided to change the options. If you disable this setting or do not configure it, it has no effect on the system.

The "Allow processing across a slow network connection" option updates the policies even when the update is being transmitted across a slow network connection, such as a telephone line. Updates across slow connections can cause significant delays.

The "Do not apply during periodic background processing" option prevents the system from updating affected policies in the background while the computer is in use. When background updates are disabled, policy changes will not take effect until the next user logon or system restart.

The "Process even if the Group Policy objects have not changed" option updates and reapplies the policies even if the policies have not changed. Many policy implementations specify that they are updated only when changed. However, you might want to update unchanged policies, such as reapplying a desired setting in case a user has changed it.</string>
      <string id="CSE_Registry">Registry policy processing</string>
      <string id="CSE_Registry_Help">Determines when registry policies are updated.

This setting affects all policies in the Administrative Templates folder and any other policies that store values in the registry.

It overrides customized settings that the program implementing a registry policy set when it was installed.

If you enable this setting, you can use the check boxes provided to change the options. If you disable this setting or do not configure it, it has no effect on the system.

The "Do not apply during periodic background processing" option prevents the system from updating affected policies in the background while the computer is in use. When background updates are disabled, policy changes will not take effect until the next user logon or system restart.

The "Process even if the Group Policy objects have not changed" option updates and reapplies the policies even if the policies have not changed. Many policy implementations specify that they are updated only when changed. However, you might want to update unchanged policies, such as reapplying a desired setting in case a user has changed it.</string>
      <string id="CSE_Scripts">Scripts policy processing</string>
      <string id="CSE_Scripts_Help">Determines when policies that assign shared scripts are updated.

This setting affects all policies that use the scripts component of Group Policy, such as those in WindowsSettings\Scripts.

It overrides customized settings that the program implementing the scripts policy set when it was installed.

If you enable this policy, you can use the check boxes provided to change the options. If you disable this setting or do not configure it, it has no effect on the system.

The "Allow processing across a slow network connection" option updates the policies even when the update is being transmitted across a slow network connection, such as a telephone line. Updates across slow connections can cause significant delays.

The "Do not apply during periodic background processing" option prevents the system from updating affected policies in the background while the computer is in use. When background updates are disabled, policy changes will not take effect until the next user logon or system restart.

The "Process even if the Group Policy objects have not changed" option updates and reapplies the policies even if the policies have not changed. Many policy implementations specify that they are updated only when changed. However, you might want to update unchanged policies, such as reapplying a desired setting in case a user has changed it.</string>
      <string id="CSE_Security">Security policy processing</string>
      <string id="CSE_Security_Help">Determines when security policies are updated.

This setting affects all policies that use the security component of Group Policy, such as those in Windows Settings\Security Settings.

It overrides customized settings that the program implementing the security policy set when it was installed.

If you enable this setting, you can use the check boxes provided to change the options. If you disable this setting or do not configure it, it has no effect on the system.

The "Do not apply during periodic background processing" option prevents the system from updating affected policies in the background while the computer is in use. When background updates are disabled, policy changes will not take effect until the next user logon or system restart.

The "Process even if the Group Policy objects have not changed" option updates and reapplies the policies even if the policies have not changed. Many policy implementations specify that they be updated only when changed. However, you might want to update unchanged policies, such as reapplying a desired setting in case a user has changed it.</string>
      <string id="CSE_Wireless">Wireless policy processing</string>
      <string id="CSE_Wireless_Help">Determines when policies that assign wireless network settings are updated.

This setting affects all policies that use the wireless network component of Group Policy, such as those in WindowsSettings\Wireless Network Policies.

It overrides customized settings that the program implementing the wireless network set when it was installed.

If you enable this policy, you can use the check boxes provided to change the options. If you disable this setting or do not configure it, it has no effect on the system.

The "Allow processing across a slow network connection" option updates the policies even when the update is being transmitted across a slow network connection, such as a telephone line. Updates across slow connections can cause significant delays.

The "Do not apply during periodic background processing" option prevents the system from updating affected policies in the background while the computer is in use. When background updates are disabled, policy changes will not take effect until the next user logon or system restart.

The "Process even if the Group Policy objects have not changed" option updates and reapplies the policies even if the policies have not changed. Many policy implementations specify that they are updated only when changed. However, you might want to update unchanged policies, such as reapplying a desired setting in case a user has changed it.</string>
      <string id="CSE_Wired">Wired policy processing</string>
      <string id="CSE_Wired_Help">Determines when policies that assign wired network settings are updated.

This setting affects all policies that use the wired network component of Group Policy, such as those in Windows Settings\Wired Network Policies.

It overrides customized settings that the program implementing the wired network set when it was installed.

If you enable this policy, you can use the check boxes provided to change the options. If you disable this setting or do not configure it, it has no effect on the system.

The "Allow processing across a slow network connection" option updates the policies even when the update is being transmitted across a slow network connection, such as a telephone line. Updates across slow connections can cause significant delays.

The "Do not apply during periodic background processing" option prevents the system from updating affected policies in the background while the computer is in use. When background updates are disabled, policy changes will not take effect until the next user logon or system restart.

The "Process even if the Group Policy objects have not changed" option updates and reapplies the policies even if the policies have not changed. Many policy implementations specify that they are updated only when changed. However, you might want to update unchanged policies, such as reapplying a desired setting in case a user has changed it.</string>

      <string id="DenyRsopToInteractiveUser">Disallow Interactive Users from generating Resultant Set of Policy data</string>
      <string id="DenyRsopToInteractiveUser_Help">This setting controls the ability of users to view their Resultant Set of Policy (RSoP) data.

By default, interactively logged on users can view their own Resultant Set of Policy (RSoP) data.

If this setting is enabled, interactive users cannot generate RSoP data.

If this setting is not configured or disabled, interactive Users can generate RSoP.

Note: This setting does not affect administrators. If this setting is enabled or disabled, by default, administrators can view RSoP data.

Note: To view RSoP data on a client computer, use the RSoP snap-in for the Microsoft Management Console. You can launch the RSoP snap-in from the command line by typing RSOP.msc

Note: This setting exists as both a User Configuration and Computer Configuration setting.

Also, see the "Turn off Resultant set of Policy Logging" setting in Computer Configuration\Administrative Templates\System\GroupPolicy.</string>
      <string id="DisableAutoADMUpdate">Turn off automatic update of ADM files</string>
      <string id="DisableAutoADMUpdate_Help">Prevents the system from updating the Administrative Templates source files automatically when you open the Group Policy Object Editor.  Administrators may want to use this if they are concerned about the amount of space used on the system volume of a DC.

By default, when you start the Group Policy Object Editor, a timestamp comparison is performed on the source files in the local %SYSTEMROOT%\inf directory and the source files stored in the GPO.  If the local files are newer, they are copied into the GPO.

Changing the status of this setting to Enabled will keep any source files from copying to the GPO.

Changing the status of this setting to Disabled will enforce the default behavior.  Files will always be copied to the GPO if they have a later timestamp.

NOTE: If the Computer Configuration policy setting, "Always use local ADM files for the Group Policy Object Editor" is enabled, the state of this setting is ignored and always treated as Enabled.</string>
      <string id="DisableBackgroundPolicy">Turn off background refresh of Group Policy</string>
      <string id="DisableBackgroundPolicy_Help">Prevents Group Policy from being updated while the computer is in use. This setting applies to Group Policy for computers, users, and domain controllers.

If you enable this setting, the system waits until the current user logs off the system before updating the computer and user settings.

If you disable this setting, updates can be applied while users are working. The frequency of updates is determined by the "Group Policy refresh interval for computers" and "Group Policy refresh interval for users" settings.

Note: If you make changes to this setting, you must restart your computer for it to take effect.</string>
      <string id="DisableUsersFromMachGP">Remove users ability to invoke machine policy refresh</string>
      <string id="DisableUsersFromMachGP_Help">This setting allows you to control a user's ability to invoke a computer policy refresh.

If you enable this setting, users may not invoke a refresh of computer policy. Computer policy will still be applied at startup or when an official policy refresh occurs.

If you disable or do not configure this setting, the default behavior applies. By default, computer policy is applied when the computer starts up. It also applies at a specified refresh interval or when manually invoked by the user.

Note: This setting only applies to non-administrators. Administrators can still invoke a refresh of computer policy at any time, no matter how this policy is configured.

Also, see the "Group Policy refresh interval for computers" setting to change the policy refresh interval.

Note: If you make changes to this setting, you must restart your computer for it to take effect.</string>
      <string id="EnforcePoliciesOnly">Enforce Show Policies Only</string>
      <string id="EnforcePoliciesOnly_Help">Prevents administrators from viewing or using Group Policy preferences.

A Group Policy administration (.adm) file can contain both true settings and preferences. True settings, which are fully supported by Group Policy, must use registry entries in the Software\Policies or Software\Microsoft\Windows\CurrentVersion\Policies registry subkeys. Preferences, which are not fully supported, use registry entries in other subkeys.

If you enable this setting, the "Show Policies Only" command is turned on, and administrators cannot turn it off. As a result, Group Policy Object Editor displays only true settings; preferences do not appear.

If you disable this setting or do not configure it, the "Show Policies Only" command is turned on by default, but administrators can view preferences by turning off the "Show Policies Only" command.

Note: To find the "Show Policies Only" command, in Group Policy Object Editor, click the Administrative Templates folder (either one), right-click the same folder, and then point to "View."

In Group Policy Object Editor, preferences have a red icon to distinguish them from true settings, which have a blue icon.</string>
      <string id="GPDCOptionAny">Use any available domain controller</string>
      <string id="GPDCOptionInherit">Inherit from Active Directory Snap-ins</string>
      <string id="GPDCOptionPDC">Use the Primary Domain Controller</string>
      <string id="GPDCOptions">Group Policy domain controller selection</string>
      <string id="GPDCOptions_Help">Determines which domain controller the Group Policy Object Editor snap-in uses.

--  "Use the Primary Domain Controller" indicates that the Group Policy Object Editor snap-in reads and writes changes to the domain controller designated as the PDC Operations Master for the domain.

--  "Inherit from Active Directory Snap-ins" indicates that the Group Policy Object Editor snap-in reads and writes changes to the domain controller that Active Directory Users and Computers or Active Directory Sites and Services snap-ins use.

--  "Use any available domain controller" indicates that the Group Policy Object Editor snap-in can read and write changes to any available domain controller.

If you disable this setting or do not configure it, the Group Policy Object Editor snap-in uses the domain controller designated as the PDC Operations Master for the domain.

Note: To change the PDC Operations Master for a domain, in Active Directory Users and Computers, right-click a domain, and then click "Operations Masters."</string>
      <string id="GPTransferRate">Group Policy slow link detection</string>
      <string id="GPTransferRate_Help">Defines a slow connection for purposes of applying and updating Group Policy.

If the rate at which data is transferred from the domain controller providing a policy update to the computers in this group is slower than the rate specified by this setting, the system considers the connection to be slow.

The system's response to a slow policy connection varies among policies. The program implementing the policy can specify the response to a slow link. Also, the policy processing settings in this folder lets you override the programs' specified responses to slow links.

To use this setting, in the "Connection speed" box, type a decimal number between 0 and 4,294,967,200, indicating a transfer rate in kilobits per second. Any connection slower than this rate is considered to be slow. If you type 0, all connections are considered to be fast.

If you disable this setting or do not configure it, the system uses the default value of 500 kilobits per second.

This setting appears in the Computer Configuration and User Configuration folders. The setting in Computer Configuration defines a slow link for policies in the Computer Configuration folder. The setting in User Configuration defines a slow link for settings in the User Configuration folder.

Also, see the "Do not detect slow network connections" and related policies in Computer Configuration\Administrative Templates\System\User Profile. Note: If the profile server has IP connectivity, the connection speed setting is used. If the profile server does not have IP connectivity, the SMB timing is used.</string>
      <string id="GroupPolicyRefreshRate">Group Policy refresh interval for computers</string>
      <string id="GroupPolicyRefreshRate_Help">Specifies how often Group Policy for computers is updated while the computer is in use (in the background). This setting specifies a background update rate only for Group Policies in the Computer Configuration folder.

In addition to background updates, Group Policy for the computer is always updated when the system starts.

By default, computer Group Policy is updated in the background every 90 minutes, with a random offset of 0 to 30 minutes.

You can specify an update rate from 0 to 64,800 minutes (45 days). If you select 0 minutes, the computer tries to update Group Policy every 7 seconds. However, because updates might interfere with users' work and increase network traffic, very short update intervals are not appropriate for most installations.

If you disable this setting, Group Policy is updated every 90 minutes (the default). To specify that Group Policy should never be updated while the computer is in use, select the "Turn off background refresh of Group Policy" policy.

The Group Policy refresh interval for computers policy also lets you specify how much the actual update interval varies. To prevent clients with the same update interval from requesting updates simultaneously, the system varies the update interval for each client by a random number of minutes. The number you type in the random time box sets the upper limit for the range of variance. For example, if you type 30 minutes, the system selects a variance of 0 to 30 minutes. Typing a large number establishes a broad range and makes it less likely that client requests overlap. However, updates might be delayed significantly.

This setting establishes the update rate for computer Group Policy. To set an update rate for user policies, use the "Group Policy refresh interval for users" setting (located in User Configuration\Administrative Templates\System\Group Policy).

This setting is only used when the "Turn off background refresh of Group Policy" setting is not enabled.

Note: Consider notifying users that their policy is updated periodically so that they recognize the signs of a policy update. When Group Policy is updated, the Windows desktop is refreshed; it flickers briefly and closes open menus. Also, restrictions imposed by Group Policies, such as those that limit the programs users can run, might interfere with tasks in progress.</string>
      <string id="GroupPolicyRefreshRateDC">Group Policy refresh interval for domain controllers</string>
      <string id="GroupPolicyRefreshRateDC_Help">Specifies how often Group Policy is updated on domain controllers while they are running (in the background). The updates specified by this setting occur in addition to updates performed when the system starts.

By default, Group Policy on the domain controllers is updated every five minutes.

You can specify an update rate from 0 to 64,800 minutes (45 days). If you select 0 minutes, the domain controller tries to update Group Policy every 7 seconds. However, because updates might interfere with users' work and increase network traffic, very short update intervals are not appropriate for most installations.

If you disable this setting, the domain controller updates Group Policy every 5 minutes (the default). To specify that Group Policies for users should never be updated while the computer is in use, select the "Turn off background refresh of Group Policy" setting.

This setting also lets you specify how much the actual update interval varies. To prevent domain controllers with the same update interval from requesting updates simultaneously, the system varies the update interval for each controller by a random number of minutes. The number you type in the random time box sets the upper limit for the range of variance. For example, if you type 30 minutes, the system selects a variance of 0 to 30 minutes. Typing a large number establishes a broad range and makes it less likely that update requests overlap. However, updates might be delayed significantly.

Note: This setting is used only when you are establishing policy for a domain, site, organizational unit (OU), or customized group. If you are establishing policy for a local computer only, the system ignores this setting.</string>
      <string id="GroupPolicyRefreshRateUser">Group Policy refresh interval for users</string>
      <string id="GroupPolicyRefreshRateUser_Help">Specifies how often Group Policy for users is updated while the computer is in use (in the background). This setting specifies a background update rate only for the Group Policies in the User Configuration folder.

In addition to background updates, Group Policy for users is always updated when users log on.

By default, user Group Policy is updated in the background every 90 minutes, with a random offset of 0 to 30 minutes.

You can specify an update rate from 0 to 64,800 minutes (45 days). If you select 0 minutes, the computer tries to update user Group Policy every 7 seconds. However, because updates might interfere with users' work and increase network traffic, very short update intervals are not appropriate for most installations.

If you disable this setting, user Group Policy is updated every 90 minutes (the default). To specify that Group Policy for users should never be updated while the computer is in use, select the "Turn off background refresh of Group Policy" setting.

This setting also lets you specify how much the actual update interval varies. To prevent clients with the same update interval from requesting updates simultaneously, the system varies the update interval for each client by a random number of minutes. The number you type in the random time box sets the upper limit for the range of variance. For example, if you type 30 minutes, the system selects a variance of 0 to 30 minutes. Typing a large number establishes a broad range and makes it less likely that client requests overlap. However, updates might be delayed significantly.

Important: If the "Turn off background refresh of Group Policy" setting is enabled, this setting is ignored.

Note: This setting establishes the update rate for user Group Policies. To set an update rate for computer Group Policies, use the "Group Policy refresh interval for computers" setting (located in Computer Configuration\Administrative Templates\System\Group Policy).

Tip: Consider notifying users that their policy is updated periodically so that they recognize the signs of a policy update. When Group Policy is updated, the Windows desktop is refreshed; it flickers briefly and closes open menus. Also, restrictions imposed by Group Policies, such as those that limit the programs a user can run, might interfere with tasks in progress.</string>
      <string id="NewGPODisplayName">Default name for new Group Policy objects</string>
      <string id="NewGPODisplayName_Help">Sets the default display name for new Group Policy objects.

This setting allows you to specify the default name for new Group Policy objects created from policy compliant Group Policy Management tools including the Group Policy tab in Active Directory tools and the GPO browser.

The display name may contain environment variables and can be a maximum of 255 characters long.

If this setting is Disabled or Not Configured, the default display name of New Group Policy object is used.</string>
      <string id="NewGPOLinksDisabled">Create new Group Policy object links disabled by default</string>
      <string id="NewGPOLinksDisabled_Help">Creates new Group Policy object links in the disabled state.

This setting creates all new Group Policy object links in the disabled state by default. After you configure and test the new object links by using a policy compliant Group Policy management tool such as  Active Directory Users and Computers or Active Directory Sites and Services, you can enable the object links for use on the system.

If you disable this setting or do not configure it, new Group Policy object links are created in the enabled state. If you do not want them to be effective until they are configured and tested, you must disable the object link.</string>
      <string id="OnlyUseLocalAdminFiles">Always use local ADM files for Group Policy Object Editor</string>
      <string id="OnlyUseLocalAdminFiles_Help">Always use local ADM files for the Group Policy snap-in.

By default, when you edit a Group Policy object (GPO) using the Group Policy Object Editor snap-in, the ADM files are loaded from that GPO into the Group Policy Object Editor snap-in. This enables you to use the same version of the ADM files that were used to create the GPO while editing this GPO.

This leads to the following behavior:

-  If you originally created the GPO with, for example, an English system, the GPO contains English ADM files.

-  If you later edit the GPO from a different-language system, you get the English ADM files as they were in the GPO.

You can change this behavior by using this setting.

If you enable this setting, the Group Policy Object Editor snap-in always uses local ADM files in your %windir%\inf directory when editing GPOs.

This leads to the following behavior:

-  If you had originally created the GPO with an English system, and then you edit the GPO with a Japanese system, the Group Policy Object Editor snap-in uses the local Japanese ADM files, and you see the text in Japanese under Administrative Templates.

If you disable or do not configure this setting, the Group Policy Object Editor snap-in always loads all ADM files from the actual GPO.

Note: If the ADMs that you require are not all available locally in your %windir%\inf directory, you might not be able to see all the settings that have been configured in the GPO that you are editing.</string>
      <string id="PolicyPolicies">Group Policy</string>
      <string id="RSoPLogging">Turn off Resultant Set of Policy logging</string>
      <string id="RSoPLogging_Help">This setting allows you to enable or disable Resultant Set of Policy (RSoP) logging on a client computer.

RSoP logs information on Group Policy settings that have been applied to the client. This information includes details such as which Group Policy objects (GPO) were applied, where they came from, and the client-side extension settings that were included.

If you enable this setting, RSoP logging is turned off.

If you disable or do not configure this setting, RSoP logging is turned on. By default, RSoP logging is always on.

Note: To view the RSoP information logged on a client computer, you can use the RSoP snap-in in the Microsoft Management Console (MMC).</string>
      <string id="UserPolicyMode">User Group Policy loopback processing mode</string>
      <string id="UserPolicyMode_Help">Applies alternate user settings when a user logs on to a computer affected by this setting.

This setting directs the system to apply the set of Group Policy objects for the computer to any user who logs on to a computer affected by this setting. It is intended for special-use computers, such as those in public places, laboratories, and classrooms, where you must modify the user setting based on the computer that is being used.

By default, the user's Group Policy objects determine which user settings apply. If this setting is enabled, then, when a user logs on to this computer, the computer's Group Policy objects determine which set of Group Policy objects applies.

To use this setting, select one of the following modes from the Mode box:

--   "Replace" indicates that the user settings defined in the computer's Group Policy objects replace the user settings normally applied to the user.

--   "Merge" indicates that the user settings defined in the computer's Group Policy objects and the user settings normally applied to the user are combined. If the settings conflict, the user settings in the computer's Group Policy objects take precedence over the user's normal settings.

If you disable this setting or do not configure it, the user's Group Policy objects determines which user settings apply.

Note: This setting is effective only when both the computer account and the user account are in Windows 2000 domains.</string>
      <string id="UserPolicyMode_Merge">Merge</string>
      <string id="UserPolicyMode_Replace">Replace</string>
    </stringTable>
    <presentationTable>
      <presentation id="SyncWaitTime">
        <decimalTextBox refId="SyncWaitTime_Minutes" defaultValue="120">Amount of time to wait (in seconds):</decimalTextBox>
      </presentation>
      <presentation id="CSE_AppMgmt">
        <checkBox refId="CSE_SLOWLINK1">Allow processing across a slow network connection</checkBox>
        <checkBox refId="CSE_NOCHANGES1">Process even if the Group Policy objects have not changed</checkBox>
      </presentation>
      <presentation id="CSE_DiskQuota">
        <checkBox refId="CSE_SLOWLINK2">Allow processing across a slow network connection</checkBox>
        <checkBox refId="CSE_NOBACKGROUND2">Do not apply during periodic background processing</checkBox>
        <checkBox refId="CSE_NOCHANGES2">Process even if the Group Policy objects have not changed</checkBox>
      </presentation>
      <presentation id="CSE_EFSRecovery">
        <checkBox refId="CSE_SLOWLINK3">Allow processing across a slow network connection</checkBox>
        <checkBox refId="CSE_NOBACKGROUND3">Do not apply during periodic background processing</checkBox>
        <checkBox refId="CSE_NOCHANGES3">Process even if the Group Policy objects have not changed</checkBox>
      </presentation>
      <presentation id="CSE_FolderRedirection">
        <checkBox refId="CSE_SLOWLINK4">Allow processing across a slow network connection</checkBox>
        <checkBox refId="CSE_NOCHANGES4">Process even if the Group Policy objects have not changed</checkBox>
      </presentation>
      <presentation id="CSE_IEM">
        <checkBox refId="CSE_SLOWLINK5">Allow processing across a slow network connection</checkBox>
        <checkBox refId="CSE_NOBACKGROUND5">Do not apply during periodic background processing</checkBox>
        <checkBox refId="CSE_NOCHANGES5">Process even if the Group Policy objects have not changed</checkBox>
      </presentation>
      <presentation id="CSE_IPSecurity">
        <checkBox refId="CSE_SLOWLINK6">Allow processing across a slow network connection</checkBox>
        <checkBox refId="CSE_NOBACKGROUND6">Do not apply during periodic background processing</checkBox>
        <checkBox refId="CSE_NOCHANGES6">Process even if the Group Policy objects have not changed</checkBox>
      </presentation>
      <presentation id="CSE_Registry">
        <checkBox refId="CSE_NOBACKGROUND10">Do not apply during periodic background processing</checkBox>
        <checkBox refId="CSE_NOCHANGES10">Process even if the Group Policy objects have not changed</checkBox>
      </presentation>
      <presentation id="CSE_Scripts">
        <checkBox refId="CSE_SLOWLINK7">Allow processing across a slow network connection</checkBox>
        <checkBox refId="CSE_NOBACKGROUND7">Do not apply during periodic background processing</checkBox>
        <checkBox refId="CSE_NOCHANGES7">Process even if the Group Policy objects have not changed</checkBox>
      </presentation>
      <presentation id="CSE_Security">
        <checkBox refId="CSE_NOBACKGROUND11">Do not apply during periodic background processing</checkBox>
        <checkBox refId="CSE_NOCHANGES11">Process even if the Group Policy objects have not changed</checkBox>
      </presentation>
      <presentation id="CSE_Wired">
        <checkBox refId="CSE_SLOWLINK8">Allow processing across a slow network connection</checkBox>
        <checkBox refId="CSE_NOBACKGROUND8">Do not apply during periodic background processing</checkBox>
        <checkBox refId="CSE_NOCHANGES8">Process even if the Group Policy objects have not changed</checkBox>
      </presentation>
      <presentation id="CSE_Wireless">
        <checkBox refId="CSE_SLOWLINK9">Allow processing across a slow network connection</checkBox>
        <checkBox refId="CSE_NOBACKGROUND9">Do not apply during periodic background processing</checkBox>
        <checkBox refId="CSE_NOCHANGES9">Process even if the Group Policy objects have not changed</checkBox>
      </presentation>
      <presentation id="GPDCOptions">
        <dropdownList refId="GPDCOptionsDesc" noSort="true" defaultItem="0">When Group Policy Object Editor is selecting a domain controller to use, it should:</dropdownList>
      </presentation>
      <presentation id="GPTransferRate_1">
        <decimalTextBox refId="TransferRateOp1" defaultValue="500" spinStep="100">Connection speed (Kbps):</decimalTextBox>
        <text> </text>
        <text>Enter 0 to disable slow link detection.</text>
      </presentation>
      <presentation id="GPTransferRate_2">
        <decimalTextBox refId="TransferRateOp2" defaultValue="500" spinStep="100">Connection speed (Kbps):</decimalTextBox>
        <text> </text>
        <text>Enter 0 to disable slow link detection.</text>
      </presentation>
      <presentation id="GroupPolicyRefreshRate">
        <text>This setting allows you to customize how often Group Policy is applied</text>
        <text>to computers. The range is 0 to 64800 minutes (45 days).</text>
        <decimalTextBox refId="GPRefreshRate1" defaultValue="90">Minutes:</decimalTextBox>
        <text> </text>
        <text>This is a random time added to the refresh interval to prevent</text>
        <text>all clients from requesting Group Policy at the same time.</text>
        <text>The range is 0 to 1440 minutes (24 hours)</text>
        <decimalTextBox refId="GPRefreshRateOffset1" defaultValue="30">Minutes:</decimalTextBox>
      </presentation>
      <presentation id="GroupPolicyRefreshRateDC">
        <text>This setting allows you to customize how often Group Policy is applied</text>
        <text>to domain controllers. The range is 0 to 64800 minutes (45 days).</text>
        <decimalTextBox refId="GPRefreshRate2" defaultValue="5">Minutes:</decimalTextBox>
        <text> </text>
        <text>This is a random time added to the refresh interval to prevent</text>
        <text>all clients from requesting Group Policy at the same time.</text>
        <text>The range is 0 to 1440 minutes (24 hours)</text>
        <decimalTextBox refId="GPRefreshRateOffset2" defaultValue="0">Minutes:</decimalTextBox>
      </presentation>
      <presentation id="GroupPolicyRefreshRateUser">
        <text>This setting allows you to customize how often Group Policy is applied</text>
        <text>to users. The range is 0 to 64800 minutes (45 days).</text>
        <decimalTextBox refId="GPRefreshRate3" defaultValue="90">Minutes:</decimalTextBox>
        <text> </text>
        <text>This is a random time added to the refresh interval to prevent</text>
        <text>all clients from requesting Group Policy at the same time.</text>
        <text>The range is 0 to 1440 minutes (24 hours)</text>
        <decimalTextBox refId="GPRefreshRateOffset3" defaultValue="30">Minutes:</decimalTextBox>
      </presentation>
      <presentation id="NewGPODisplayName">
        <textBox refId="NewGPODisplayNameHeading">
          <label>GPO Name:</label>
        </textBox>
      </presentation>
      <presentation id="UserPolicyMode">
        <dropdownList refId="UserPolicyModeOp" noSort="true" defaultItem="1">Mode:</dropdownList>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
