<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>Online Assistance</displayName>
  <description>Online Assistance</description>
  <resources>
    <stringTable>
      <string id="Assistance">Online Assistance</string>
      <string id="windowscomponents">Windows Components</string>
      <string id="ActiveHelpPolicy_Explain">Specifies whether active content links in trusted assistance content are rendered.  By default, the Help viewer renders trusted assistance content with active elements such as ShellExecute links and Guided Help links.

If you enable this policy, such links are not rendered. The text is displayed but there are no clickable links for these elements.

If you Disable or do not configure this setting, the default behavior (Help viewer renders trusted assistance content with active elements) applies.</string>
      <string id="ActiveHelp">Turn off Active Help</string>
      <string id="HPExplicitFeedback">Turn off Help Ratings</string>
      <string id="HPExplicitFeedbackPolicy_Explain">Specifies whether users can provide ratings for Help content.

If this setting is enabled, this policy setting prevents ratings controls from being added to Help content.

If this setting is disabled or not configured, a rating control will be added to Help topics.

Users can use the control to provide feedback on the quality and usefulness of the Help and Support content.</string>
      <string id="HPImplicitFeedback">Turn off Help Experience Improvement Program</string>
      <string id="HPImplicitFeedbackPolicy_Explain">Specifies whether users can participate in the Help Experience Improvement program. The Help Experience Improvement program collects information about how customers use Windows Help so that Microsoft can improve it.

If this setting is enabled, this policy prevents users from participating in the Help Experience Improvement program.

If this setting is disabled or not configured, users will be able to turn on the Help Experience Improvement program feature from the Help and Support settings page.</string>
      <string id="HPOnlineAssistance">Turn off Windows Online</string>
      <string id="HPOnlineAssistancePolicy_Explain">Specifies whether users can search and view content from Windows Online in Help and Support. Windows Online provides the most up-to-date Help content for Windows.

If this settings is enabled, users will be prevented from accessing online assistance content from Windows Online.

If this setting is disabled or not configured, users will be able to access online assistance if they have a connection to the Internet and have not disabled Windows Online from the Help and Support Options page.</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
