<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="UseOEMBackground">Always use custom logon background</string> 
      <string id="UseOEMBackground_Help">Ignores Windows Logon Background.

This policy setting may be used to make Windows give preference to a custom logon background. 

If you enable this policy setting, the logon screen will always attempt to load a custom background instead of the Windows-branded logon background. 

If you disable or do not configure this policy setting, Windows will use the default Windows logon background or custom background.</string> 
      <string id="DisableExplorerRunLegacy">Do not process the legacy run list</string>
      <string id="DisableExplorerRunLegacy_Help">Ignores the customized run list.

You can create a customized list of additional programs and documents that the system starts automatically when it runs on Windows Vista, Windows XP Professional, and Windows 2000 Professional. These programs are added to the standard run list of programs and services that the system starts.

If you enable this policy setting, the system ignores the run list for Windows Vista, Windows 2000 Professional, and Windows XP Professional.

If you disable or do not configure this policy setting, Windows Vista adds any customized run list configured to its run list.

This policy setting appears in the Computer Configuration and User Configuration folders. If both policy settings are configured, the policy setting in Computer Configuration takes precedence over the policy setting in User Configuration.

Note: To create a customized run list by using a policy, use the "Run these applications at startup" policy setting.

Also, see the "Do not process the run once list" policy setting.</string>
      <string id="DisableExplorerRunOnceLegacy">Do not process the run once list</string>
      <string id="DisableExplorerRunOnceLegacy_Help">Ignores customized run-once lists.

You can create a customized list of additional programs and documents that are started automatically the next time the system starts (but not thereafter). These programs are added to the standard list of programs and services that the system starts.

If you enable this setting, the system ignores the run-once list.

If you disable this setting or do not configure it, the system runs the programs in the run-once list.

This setting appears in the Computer Configuration and User Configuration folders. If both settings are configured, the setting in Computer Configuration takes precedence over the setting in User Configuration.

Note: Customized run-once lists are stored in the registry in HKEY_LOCAL_MACHINE\Software\Microsoft\Windows\CurrentVersion\RunOnce.

Also, see the "Do not process the legacy run list" setting.</string>
      <string id="DisableStatusMessages">Remove Boot / Shutdown / Logon / Logoff status messages</string>
      <string id="DisableStatusMessages_Help">Suppresses system status messages.

If you enable this setting, the system does not display a message reminding users to wait while their system starts or shuts down, or while users log on or off.</string>
      <string id="Logon">Logon</string>
      <string id="LogonType">Always use classic logon</string>
      <string id="LogonType_Help">This setting forces the user to log on to the computer using the classic logon screen. By default, a workgroup is set to use the simple logon screen. This setting only works when the computer is not on a domain.</string>
      <string id="NoWelcomeTips">Don't display the Getting Started welcome screen at logon</string>
      <string id="NoWelcomeTips_Help">Supresses the welcome screen.

This setting hides the welcome screen that is displayed on Windows 2000 Professional each time the user logs on.

Users can still display the welcome screen by selecting it on the Start menu or by typing "Welcome" in the Run dialog box.

This setting applies only to Windows 2000 Professional. It does not affect the "Configure Your Server on a Windows 2000 Server" screen on Windows 2000 Server.

Note: This setting appears in the Computer Configuration and User Configuration folders. If both settings are configured, the setting in Computer Configuration takes precedence over the setting in User Configuration.

Tip: To display the welcome screen, click Start, point to Programs, point to Accessories, point to System Tools, and then click "Getting Started." To suppress the welcome screen without specifying a setting, clear the "Show this screen at startup" check box on the welcome screen.</string>
      <string id="Run">Run these programs at user logon</string>
      <string id="Run_Help">Specifies additional programs or documents that Windows starts automatically when a user logs on to the system.

To specify values for this setting, click Show. In the Show Contents dialog box in the Value column, type the name of the executable program (.exe) file or document file. To specify another name, press ENTER, and type the name. Unless the file is located in the %Systemroot% directory, you must specify the fully qualified path to the file.

Note: This setting appears in the Computer Configuration and User Configuration folders. If both settings are configured, the system starts the programs specified in the Computer Configuration setting just before it starts the programs specified in the User Configuration setting.

Also, see the "Do not process the legacy run list" and the "Do not process the run once list" settings.</string>
      <string id="SyncForegroundPolicy">Always wait for the network at computer startup and logon</string>
      <string id="SyncForegroundPolicy_Help">
This policy setting determines whether Group Policy processing is synchronous (that is, whether computers wait for the network to be fully initialized during computer startup and user logon). By default, on client computers, Group Policy processing is not synchronous; client computers typically do not wait for the network to be fully initialized at startup and logon. Existing users are logged on using cached credentials, which results in shorter logon times. Group Policy is applied in the background after the network becomes available. 

Note that because this is a background refresh, extensions such as Software Installation and Folder Redirection take two logons to apply changes. To be able to operate safely, these extensions require that no users be logged on. Therefore, they must be processed in the foreground before users are actively using the computer. In addition, changes that are made to the user object, such as adding a roaming profile path, home directory, or user object logon script, may take up to two logons to be detected.

If a user with a roaming profile, home directory, or user object logon script logs on to a computer, computers always wait for the network to be initialized before logging the user on. If a user has never logged on to this computer before, computers always wait for the network to be initialized.

If you enable this policy setting, computers wait for the network to be fully initialized before users are logged on. Group Policy is applied in the foreground, synchronously. 

On servers running Windows Server 2008 or later, this policy setting is ignored during Group Policy processing at computer startup and Group Policy processing will be synchronous (these servers wait for the network to be initialized during computer startup). 

If the server is configured as follows, this policy setting takes effect during Group Policy processing at user logon:
•  The server is configured as a terminal server (that is, the Terminal Server role service is installed and configured on the server); and
•  The “Allow asynchronous user Group Policy processing when logging on through Terminal Services” policy setting is enabled. This policy setting is located under Computer Configuration\Policies\Administrative templates\System\Group Policy\.
If this configuration is not implemented on the server, this policy setting is ignored. In this case, Group Policy processing at user logon is synchronous (these servers wait for the network to be initialized during user logon).

If you disable or do not configure this policy setting and users log on to a client computer or a server running Windows Server 2008 or later and that is configured as described earlier, the computer typically does not wait for the network to be fully initialized. In this case, users are logged on with cached credentials. Group Policy is applied asynchronously in the background.

Notes: 
If you want to guarantee the application of Folder Redirection, Software Installation, or roaming user profile settings in just one logon, enable this policy setting to ensure that Windows waits for the network to be available before applying policy. 
If Folder Redirection policy will apply during the next logon, security policies will be applied asynchronously during the next update cycle, if network connectivity is available.</string>
      <string id="VerboseStatus">Verbose vs normal status messages</string>
      <string id="VerboseStatus_Help">Directs the system to display highly detailed status messages.

If you enable this setting, the system displays status messages that reflect each step in the process of starting, shutting down, logging on, or logging off the system.

This setting is designed for sophisticated users that require this information.

Note: This setting is ignored if the "Remove Boot / Shutdown / Logon / Logoff status messages" setting is enabled.</string>
      <string id="HideFastUserSwitching">Hide entry points for Fast User Switching</string>
      <string id="HideFastUserSwitching_Help">By enabling the policy, Administrators hide the Switch user button in the Logon UI, the Start menu and the Task Manager.</string>
      <string id="DisableStartupSound">Turn off Windows Startup Sound</string>
      <string id="DisableStartupSound_Help">Turn off the Windows Startup sound and prevent its customization in the Sound item of Control Panel.

The Microsoft Windows Startup sound is heard during system startup and cold startup and can be turned on or off in the Sound item of Control Panel.

Enabling or disabling this setting will automatically prevent users from customizing the default behavior of the Windows Startup sound.

If this policy setting is enabled, the Windows Startup sound will be turned off for all users.

If this policy setting is disabled, the Windows Startup sound will be turned on for all users.

If this policy setting is not configured, the Windows Startup sound will be turned on for all users by default and customizable in the Sound item of Control Panel.

This policy setting does not prevent users from setting preferences for other system sounds.</string>

    </stringTable>
    <presentationTable>
      <presentation id="Run_1">
        <listBox refId="RunListBox1">Items to run at logon</listBox>
      </presentation>
      <presentation id="Run_2">
        <listBox refId="RunListBox2">Items to run at logon</listBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
