<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="DisableNetworkProjector">Turn off Connect to a Network Projector</string>
      <string id="DisableNetworkProjectorExplain">Disables the Connect to a Network Projector wizard so that users cannot connect to a network projector.

If you enable this policy, users cannot use the Connect to a Network Projector wizard to connect to a projector.

If you disable this policy or do not configure it, users can run the Connect to a Network Projector wizard to connect to a projector.</string>
      <string id="NetworkProjectorCat">Network Projector</string>
      <string id="NetworkProjectionPortNo">Network Projector Port Setting</string>
      <string id="NetworkProjectionPortNoExplain">This policy setting allows you to select the TCP port the Network Projector will use to send packets. If you leave the 0, the operating system will select a port. If you select a TCP port that is already in use by a system, the Network Projector will fail to initialize.

If you enable this policy setting, you can customize a TCP port for the Network Projector.</string>
    </stringTable>
    <presentationTable>
      <presentation id="NetworkProjectionPortNo">
        <text>The setting allows you to customize the Network Projector port</text>
        <text>The range is 0 to 65535. Default is 5363.</text>
        <decimalTextBox refId="NetworkProjectionPortNoBox" defaultValue="5363"> </decimalTextBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
