<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="ParentalControls">Parental Controls</string>
      <string id="ParentalControls_EnableOnDomain_help">Configure the Parental Controls feature.

If you turn on this setting, the Parental Controls control panel will be visible on a domain joined computer.

If you turn off or do not configure this setting, the Parental Controls control panel will not be visible on a domain joined computer.</string>
      <string id="ParentalControls_EnableOnDomain">Make Parental Controls control panel visible on a Domain</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
