<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="ACCriticalSleepTransitionsDisable">Turn on the Ability for Applications to Prevent Sleep Transitions (Plugged In)</string>
      <string id="ACHibernateTimeOut">Specify the System Hibernate Timeout (Plugged In)</string>
      <string id="ACPowerButtonAction">Select the Power Button Action (Plugged In)</string>
      <string id="ACPromptForPasswordOnResume">Require a Password When a Computer Wakes (Plugged In)</string>
      <string id="ACSleepButtonAction">Select the Sleep Button Action (Plugged In)</string>
      <string id="ACStartMenuButtonAction">Select the Start Menu Power Button Action (Plugged In)</string>
      <string id="ACStandbyTimeOut">Specify the System Sleep Timeout (Plugged In)</string>
      <string id="ACStandbyWithHiberfileEnable">Turn Off Hybrid Sleep (Plugged In)</string>
      <string id="ACSystemLidAction">Select the Lid Switch Action (Plugged In)</string>
      <string id="BatteryDischargeAction0Explain">Specifies the action that Windows takes when battery capacity reaches the critical battery notification level.

Possible actions include:

-Take no action
-Sleep
-Hibernate
-Shut down

If you enable this policy setting, you must select the desired action.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>
      <string id="BatteryDischargeAction1Explain">Specifies the action that Windows takes when battery capacity reaches the low battery notification level.

Possible actions include:

-Take no action
-Sleep
-Hibernate
-Shut down

If you enable this policy setting, you must select the desired action.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>
      <string id="BatteryDischargeLevel0Explain">Specifies the percentage of battery capacity remaining that triggers the critical battery notification action.

If you enable this policy, you must enter a numeric value (percentage) to set the battery level that triggers the critical notification.

To set the action that is triggered, see the "Critical Battery Notification Action" policy setting.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>
      <string id="BatteryDischargeLevel1Explain">Specifies the percentage of battery capacity remaining that triggers the low battery notification action.

If you enable this policy, you must enter a numeric value (percentage) to set the battery level that triggers the low notification.

To set the action that is triggered, see the "Low Battery Notification Action" policy setting.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>
      <string id="BatteryDischargeLevel1UINotificationExplain">Disables a user notification when the battery capacity remaining equals the low battery notification level.

If you enable this policy, Windows will not show a notification when the battery capacity remaining equals the low battery notification level.  To configure the low battery notification level, see the "Low Battery Notification Level" policy setting.

The notification will only be shown if the "Low Battery Notification Action" policy setting is configured to "No Action".

If you do not configure this policy setting, users can see and change this setting.</string>
      <string id="ButtonActionHibernate">Hibernate</string>
      <string id="ButtonActionNone">Take no action</string>
      <string id="ButtonActionShutdown">Shut down</string>
      <string id="ButtonActionStandby">Sleep</string>
      <string id="CriticalSleepTransitionsDisableExplain">Enables applications and services to prevent the system from sleeping.

If you enable this policy setting, an application or service may prevent the system from sleeping (Hybrid Sleep, Stand By, or Hibernate).

If you disable this policy setting or do not configure it, users can see and change this setting.</string>
      <string id="CustomActiveSchemeOverride">Specify a Custom Active Power Plan</string>
      <string id="CustomActiveSchemeOverrideExplain">Specifies the active power plan from a specified power plan’s GUID.  The GUID for a custom power plan GUID can be retrieved by using powercfg, the power configuration command line tool.  

If you enable this policy setting, you must specify a power plan, specified as a GUID using the following format: XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX (For example, 103eea6e-9fcd-4544-a713-c282d8e50083), indicating the power plan to be active.

If you disable this policy or do not configure it, users can see and change this setting.</string>
      <string id="DCBatteryDischargeAction0">Critical Battery Notification Action</string>
      <string id="DCBatteryDischargeAction1">Low Battery Notification Action</string>
      <string id="DCBatteryDischargeLevel0">Critical Battery Notification Level</string>
      <string id="DCBatteryDischargeLevel1">Low Battery Notification Level</string>
      <string id="DCBatteryDischargeLevel1UINotification">Turn Off Low Battery User Notification</string>
      <string id="DCCriticalSleepTransitionsDisable">Turn on the Ability for Applications to Prevent Sleep Transitions (On Battery)</string>
      <string id="DCHibernateTimeOut">Specify the System Hibernate Timeout (On Battery)</string>
      <string id="DCPowerButtonAction">Select the Power Button Action (On Battery)</string>
      <string id="DCPromptForPasswordOnResume">Require a Password When a Computer Wakes (On Battery)</string>
      <string id="DCSleepButtonAction">Select the Sleep Button Action (On Battery)</string>
      <string id="DCStartMenuButtonAction">Select the Start Menu Power Button Action (On Battery)</string>
      <string id="DCStandbyTimeOut">Specify the System Sleep Timeout (On Battery)</string>
      <string id="DCStandbyWithHiberfileEnable">Turn Off Hybrid Sleep (On Battery)</string>
      <string id="DCSystemLidAction">Select the Lid Switch Action (On Battery)</string>
      <string id="DiskACPowerDownTimeOut">Turn Off the Hard Disk (Plugged In)</string>
      <string id="DiskDCPowerDownTimeOut">Turn Off the Hard Disk (On Battery)</string>
      <string id="DiskPowerDownTimeOutExplain">Specifies the period of inactivity before Windows turns off the hard disk.

If you enable this policy, you must provide a value, in seconds, indicating how much idle time should elapse before Windows turns off the hard disk.

If you disable this policy or do not configure it, users can see and change this setting.</string>
      <string id="Dont_PowerOff_AfterShutdown">Do not turn off system power after a Windows system shutdown has occurred.</string>
      <string id="Dont_PowerOff_AfterShutdown_Help">This setting allows you to configure whether power is automatically turned off when Windows shutdown completes.  This setting does not effect Windows shutdown behavior when shutdown is manually selected using the Start menu or Task Manager user interfaces.  Applications such as UPS software may rely on Windows shutdown behavior.

This setting is only applicable when Windows shutdown is initiated by software programs invoking the Windows programming interfaces ExitWindowsEx() or InitiateSystemShutdown().

If you enable this setting, the computer system will be safely shutdown, and remain in a powered state, ready for power to be safely removed.
If you disable or do not configure this setting, the computer system will safely shutdown to a fully powered-off state.</string>
      <string id="HibernateTimeOutExplain">Specifies the period of inactivity before Windows transitions the system to hibernate.

If you enable this policy setting, you must provide a value, in seconds, indicating how much idle time should elapse before Windows transitions to hibernate.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>
      <string id="InboxActiveSchemeOverride">Select an Active Power Plan</string>
      <string id="InboxActiveSchemeOverrideExplain">Specifies the active power plan from a list of default Windows power plans. To specify a custom power plan, use the Custom Active Power Plan setting.

If you enable this policy setting, you must specify a power plan from the Active Power Plan list.

If you disable this policy or do not configure it, users can see and change this setting.</string>
      <string id="Power_Plan_GUID_Max_Power_Savings">Power Saver</string>
      <string id="Power_Plan_GUID_Min_Power_Savings">High Performance</string>
      <string id="Power_Plan_GUID_Typical_Savings">Automatic (recommended)</string>
      <string id="PowerBatteryAlarmSettingsCat">Notification Settings</string>
      <string id="PowerButtonActionExplain">Specifies the action that Windows takes when a user presses the power button.

Possible actions include:

-Take no action
-Sleep 
-Hibernate
-Shut down

If you enable this policy setting, you must select the desired action.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>
      <string id="PowerButtonActionSettingsCat">Button Settings</string>
      <string id="PowerHardDiskSettingsCat">Hard Disk Settings</string>
      <string id="PowerManagementCat">Power Management</string>
      <string id="PowerSleepSettingsCat">Sleep Settings</string>
      <string id="PowerVideoSettingsCat">Video and Display Settings</string>
      <string id="PromptForPasswordOnResumeExplain">Specifies whether or not the user is prompted for a password when the system resumes from sleep. 

If you enable this policy, or if it is not configured, the user is prompted for a password when the system resumes from sleep. 

If you disable this policy, the user is not prompted for a password when the system resumes from sleep.</string>
      <string id="PW_PromptPasswordOnResume">Prompt for password on resume from hibernate / suspend</string>
      <string id="PW_PromptPasswordOnResume_Help">This settings allows you to configure client computers to always lock when resuming from a hibernate or suspend.

If you enable this setting, the client computer is locked when it is resumed from a suspend or hibernate state.

If you disable or do not configure this setting, users can decide if their computer is automatically locked or not after performing a resume operation.</string>
      <string id="SleepButtonActionExplain">Specifies the action that Windows takes when a user presses the sleep button.

Possible actions include:

-Take no action
-Sleep
-Hibernate
-Shut down

If you enable this policy setting, you must select the desired action.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>
      <string id="StartMenuButtonActionExplain">Specifies the action that Windows takes when a user presses the user interface sleep button.

Possible actions include:

-Sleep
-Hibernate
-Shut down

If you enable this policy setting, you must select the desired action.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>
      <string id="StandbyTimeOutExplain">Specifies the period of inactivity before Windows transitions the system to sleep.

If you enable this policy setting, you must provide a value, in seconds, indicating how much idle time should elapse before Windows transitions to sleep.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>
      <string id="StandbyWithHiberfileEnableExplain">Disables Hybrid Sleep.

If you enable this policy setting, a hiberfile is not generated when the system transitions to sleep (Stand By).

If you do not configure this policy setting, users can see and change this setting.</string>
      <string id="SystemLidActionExplain">Specifies the action that Windows takes when a user closes the lid on a mobile PC.

Possible actions include:

-Take no action
-Sleep
-Hibernate
-Shut down

If you enable this policy setting, you must select the desired action.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>
      <string id="VideoAdaptivePowerDownTimeOutAC">Turn Off Adaptive Display Timeout (Plugged In)</string>
      <string id="VideoAdaptivePowerDownTimeOutDC">Turn Off Adaptive Display Timeout (On Battery)</string>
      <string id="VideoAdaptivePowerDownTimeOutExplain">Manages how Windows controls the setting that specifies how long a computer must be inactive before Windows turns off the computer’s display.  

When this policy is enabled, Windows automatically adjusts the setting based on what users do with their keyboard or mouse to keep the display on. When this policy is disabled, Windows uses the same setting regardless of users’ keyboard or mouse behavior. If you don’t configure this setting, users can see and change this setting.</string>
      <string id="VideoPowerDownTimeOutAC">Turn Off the Display (Plugged In)</string>
      <string id="VideoPowerDownTimeOutDC">Turn Off the Display (On Battery)</string>
      <string id="VideoPowerDownTimeOutExplain">Specifies the period of inactivity before Windows turns off the display.

If you enable this policy, you must provide a value, in seconds, indicating how much idle time should elapse before Windows turns off the display.

If you disable this policy or do not configure it, users can see and change this setting.</string>
      <string id="AllowStandbyStatesAC">Allow Standby States (S1-S3) When Sleeping (Plugged In)</string>
      <string id="AllowStandbyStatesDC">Allow Standby States (S1-S3) When Sleeping (On Battery)</string>
      <string id="AllowStandbyStatesExplain">Dictates whether or not Windows is allowed to use standby states when sleeping the computer.  
      
When this policy is enabled, Windows may use standby states to sleep the computer. If this policy is disabled, the only sleep state a computer may enter is hibernate.</string>

      <string id="AllowSystemSleepWithRemoteFilesOpenAC">Allow Automatic Sleep with Open Network Files (Plugged In)</string>
      <string id="AllowSystemSleepWithRemoteFilesOpenDC">Allow Automatic Sleep with Open Network Files (On Battery)</string>
      <string id="AllowSystemSleepWithRemoteFilesOpenExplain">Allow Automatic Sleep with Open Network Files.
      
If you enable this policy setting, the computer will automatically sleep when network files are open.  

If you disable this policy setting, the computer will not automatically sleep when network files are open.</string>
    
      <string id="DisplayDimTimeOutAC">Reduce Display Brightness (Plugged In)</string>
      <string id="DisplayDimTimeOutDC">Reduce Display Brightness (On Battery)</string>
      <string id="DisplayDimTimeOutExplain">Specify the period of inactivity before Windows automatically reduces brightness of the display.  
      
If you enable this policy setting, you must provide a value, in seconds, indicating how much idle time should elapse before Windows automatically reduces the brightness of the display.

Windows will only reduce the brightness of the primary display integrated into the computer.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>

      <string id="DisplayDimBrightnessAC">Specify the Display Dim Brightness (Plugged In)</string>
      <string id="DisplayDimBrightnessDC">Specify the Display Dim Brightness (On Battery)</string>
      <string id="DisplayDimBrightnessExplain">Specify the brightness of the display when Windows automatically reduces brightness of the display.
      
If you enable this policy setting, you must provide a value, in percentage, indicating the display brightness when Windows automatically reduces brightness of the display.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>

      <string id="EnableDesktopSlideShowAC">Turn On Desktop Background Slideshow (Plugged In)</string>
      <string id="EnableDesktopSlideShowDC">Turn On Desktop Background Slideshow (On Battery)</string>
      <string id="EnableDesktopSlideShowExplain">Specify if Windows should enable the desktop background slideshow.
      
If you enable this policy setting, desktop background slideshow is enabled.

If you disable this policy setting, the desktop background slideshow is disabled.

if you do not configure this setting, users can see and change this setting.</string>

      <string id="UnattendedSleepTimeOutAC">Specify the Unattended Sleep Timeout (Plugged In)</string>
      <string id="UnattendedSleepTimeOutDC">Specify the Unattended Sleep Timeout (On Battery)</string>
      <string id="UnattendedSleepTimeOutExplain">Specify the period of inactivity before Windows transitions to sleep automatically when a user is not present at the computer.
      
If you enable this policy setting, you must provide a value, in seconds, indicating how much idle time should elapse before Windows automatically transitions to sleep when left unattended.  If you specify 0 seconds, Windows will not automatically transition to sleep.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>

      <string id="AllowSystemPowerRequestAC">Allow Applications to Prevent Automatic Sleep (Plugged In)</string>
      <string id="AllowSystemPowerRequestDC">Allow Applications to Prevent Automatic Sleep (On Battery)</string>
      <string id="AllowSystemPowerRequestExplain">Allow applications and services to prevent automatic sleep.
      
If you enable this policy setting, any application, service or device driver may prevent Windows from automatically transitioning to sleep after a period of user inactivity.

If you disable this policy setting, applications, services or drivers may not prevent Windows from automatically transitioning to sleep.  Only user input will be used to determine if Windows should automatically sleep.</string>

      <string id="ReserveBatteryNotificationLevel">Reserve Battery Notification Level</string>
      <string id="ReserveBatteryNotificationLevelExplain">Specify the percentage of battery capacity remaining that triggers the reserve power mode.
      
If you enable this policy setting, you must enter a numeric value (percentage) to set the battery level that triggers the reserve power notification.

If you disable this policy setting or do not configure it, users can see and change this setting.</string>
    
    </stringTable>
    <presentationTable>
      <presentation id="ACHibernateTimeOut_1">
        <decimalTextBox refId="EnterACHibernateTimeOut">System Hibernate Timeout (seconds):</decimalTextBox>
      </presentation>
      <presentation id="ACHibernateTimeOut_2">
        <decimalTextBox refId="EnterACHibernateTimeOut">System Hibernate Timeout (seconds):</decimalTextBox>
      </presentation>
      <presentation id="ACPowerButtonAction_1">
        <dropdownList refId="SelectACPowerButtonAction">Power Button Action</dropdownList>
      </presentation>
      <presentation id="ACPowerButtonAction_2">
        <dropdownList refId="SelectACPowerButtonAction">Power Button Action</dropdownList>
      </presentation>
      <presentation id="ACSleepButtonAction_1">
        <dropdownList refId="SelectACSleepButtonAction">Sleep Button Action</dropdownList>
      </presentation>
      <presentation id="ACSleepButtonAction_2">
        <dropdownList refId="SelectACSleepButtonAction">Sleep Button Action</dropdownList>
      </presentation>
      <presentation id="ACStartMenuButtonAction_1">
        <dropdownList refId="SelectACStartMenuButtonAction">User Interface Sleep Button Action</dropdownList>
      </presentation>
      <presentation id="ACStartMenuButtonAction_2">
        <dropdownList refId="SelectACStartMenuButtonAction">User Interface Sleep Button Action</dropdownList>
      </presentation>
      <presentation id="ACStandbyTimeOut_1">
        <decimalTextBox refId="EnterACStandbyTimeOut">System Sleep Timeout (seconds):</decimalTextBox>
      </presentation>
      <presentation id="ACStandbyTimeOut_2">
        <decimalTextBox refId="EnterACStandbyTimeOut">System Sleep Timeout (seconds):</decimalTextBox>
      </presentation>
      <presentation id="ACSystemLidAction_1">
        <dropdownList refId="SelectACSystemLidAction">Lid Switch Action</dropdownList>
      </presentation>
      <presentation id="ACSystemLidAction_2">
        <dropdownList refId="SelectACSystemLidAction">Lid Switch Action</dropdownList>
      </presentation>
      <presentation id="CustomActiveSchemeOverride_1">
        <textBox refId="CustomActiveSchemeOverrideEnter">
          <label>Custom Active Power Plan (GUID):</label>
        </textBox>
      </presentation>
      <presentation id="CustomActiveSchemeOverride_2">
        <textBox refId="CustomActiveSchemeOverrideEnter">
          <label>Custom Active Power Plan (GUID):</label>
        </textBox>
      </presentation>
      <presentation id="DCBatteryDischargeAction0_1">
        <dropdownList refId="SelectDCBatteryDischargeAction0">Critical Battery Notification Action</dropdownList>
      </presentation>
      <presentation id="DCBatteryDischargeAction0_2">
        <dropdownList refId="SelectDCBatteryDischargeAction0">Critical Battery Notification Action</dropdownList>
      </presentation>
      <presentation id="DCBatteryDischargeAction1_1">
        <dropdownList refId="SelectDCBatteryDischargeAction1">Low Battery Notification Action</dropdownList>
      </presentation>
      <presentation id="DCBatteryDischargeAction1_2">
        <dropdownList refId="SelectDCBatteryDischargeAction1">Low Battery Notification Action</dropdownList>
      </presentation>
      <presentation id="DCBatteryDischargeLevel0_1">
        <decimalTextBox refId="EnterDCBatteryDischargeLevel0">Critical Battery Notification Level</decimalTextBox>
      </presentation>
      <presentation id="DCBatteryDischargeLevel0_2">
        <decimalTextBox refId="EnterDCBatteryDischargeLevel0">Critical Battery Notification Level</decimalTextBox>
      </presentation>
      <presentation id="DCBatteryDischargeLevel1_1">
        <decimalTextBox refId="EnterDCBatteryDischargeLevel1">Low Battery Notification Level</decimalTextBox>
      </presentation>
      <presentation id="DCBatteryDischargeLevel1_2">
        <decimalTextBox refId="EnterDCBatteryDischargeLevel1">Low Battery Notification Level</decimalTextBox>
      </presentation>
      <presentation id="DCHibernateTimeOut_1">
        <decimalTextBox refId="EnterDCHibernateTimeOut">System Hibernate Timeout (seconds):</decimalTextBox>
      </presentation>
      <presentation id="DCHibernateTimeOut_2">
        <decimalTextBox refId="EnterDCHibernateTimeOut">System Hibernate Timeout (seconds):</decimalTextBox>
      </presentation>
      <presentation id="DCPowerButtonAction_1">
        <dropdownList refId="SelectDCPowerButtonAction">Power Button Action</dropdownList>
      </presentation>
      <presentation id="DCPowerButtonAction_2">
        <dropdownList refId="SelectDCPowerButtonAction">Power Button Action</dropdownList>
      </presentation>
      <presentation id="DCSleepButtonAction_1">
        <dropdownList refId="SelectDCSleepButtonAction">Sleep Button Action</dropdownList>
      </presentation>
      <presentation id="DCSleepButtonAction_2">
        <dropdownList refId="SelectDCSleepButtonAction">Sleep Button Action</dropdownList>
      </presentation>
      <presentation id="DCStartMenuButtonAction_1">
        <dropdownList refId="SelectDCStartMenuButtonAction">User Interface Sleep Button Action</dropdownList>
      </presentation>
      <presentation id="DCStartMenuButtonAction_2">
        <dropdownList refId="SelectDCStartMenuButtonAction">User Interface Sleep Button Action</dropdownList>
      </presentation>
      <presentation id="DCStandbyTimeOut_1">
        <decimalTextBox refId="EnterDCStandbyTimeOut">System Sleep Timeout (seconds):</decimalTextBox>
      </presentation>
      <presentation id="DCStandbyTimeOut_2">
        <decimalTextBox refId="EnterDCStandbyTimeOut">System Sleep Timeout (seconds):</decimalTextBox>
      </presentation>
      <presentation id="DCSystemLidAction_1">
        <dropdownList refId="SelectDCSystemLidAction">Lid Switch Action</dropdownList>
      </presentation>
      <presentation id="DCSystemLidAction_2">
        <dropdownList refId="SelectDCSystemLidAction">Lid Switch Action</dropdownList>
      </presentation>
      <presentation id="DiskACPowerDownTimeOut_1">
        <decimalTextBox refId="EnterDiskACPowerDownTimeOut">Turn Off the Hard Disk (seconds):</decimalTextBox>
      </presentation>
      <presentation id="DiskACPowerDownTimeOut_2">
        <decimalTextBox refId="EnterDiskACPowerDownTimeOut">Turn Off the Hard Disk (seconds):</decimalTextBox>
      </presentation>
      <presentation id="DiskDCPowerDownTimeOut_1">
        <decimalTextBox refId="EnterDiskDCPowerDownTimeOut">Turn Off the Hard Disk (seconds):</decimalTextBox>
      </presentation>
      <presentation id="DiskDCPowerDownTimeOut_2">
        <decimalTextBox refId="EnterDiskDCPowerDownTimeOut">Turn Off the Hard Disk (seconds):</decimalTextBox>
      </presentation>
      <presentation id="InboxActiveSchemeOverride_1">
        <dropdownList refId="InboxActiveSchemeOverrideEnter" defaultItem="0">Active Power Plan:</dropdownList>
      </presentation>
      <presentation id="InboxActiveSchemeOverride_2">
        <dropdownList refId="InboxActiveSchemeOverrideEnter" defaultItem="0">Active Power Plan:</dropdownList>
      </presentation>
      <presentation id="VideoPowerDownTimeOutAC_1">
        <decimalTextBox refId="EnterVideoACPowerDownTimeOut">Turn Off the Display (seconds):</decimalTextBox>
      </presentation>
      <presentation id="VideoPowerDownTimeOutAC_2">
        <decimalTextBox refId="EnterVideoACPowerDownTimeOut">Turn Off the Display (seconds):</decimalTextBox>
      </presentation>
      <presentation id="VideoPowerDownTimeOutDC_1">
        <decimalTextBox refId="EnterVideoDCPowerDownTimeOut">Turn Off the Display (seconds):</decimalTextBox>
      </presentation>
      <presentation id="VideoPowerDownTimeOutDC_2">
        <decimalTextBox refId="EnterVideoDCPowerDownTimeOut">Turn Off the Display (seconds):</decimalTextBox>
      </presentation>
      <presentation id="DisplayDimTimeOut">
        <decimalTextBox refId="EnterDisplayDimTimeOut">Reduce Display Brightness (seconds):</decimalTextBox>
      </presentation>
      <presentation id="DisplayDimBrightness">
        <decimalTextBox refId="EnterDisplayDimBrightness">Display Dim Brightness (percent):</decimalTextBox>
      </presentation>
      <presentation id="UnattendedSleepTimeOut">
        <decimalTextBox refId="EnterUnattendedSleepTimeOut">Unattended Sleep Timeout (seconds):</decimalTextBox>
      </presentation>
      <presentation id="ReserveBatteryNotificationLevel">
        <decimalTextBox refId="EnterReserveBatteryNotificationLevel">Reserve Battery Notification Level (percent):</decimalTextBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
