<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="EE_EnablePersistentTimeStamp">Enable Persistent Time Stamp</string>
      <string id="EE_EnablePersistentTimeStamp_Help">The Persistent System Timestamp allows the system to detect the time of unexpected shutdowns by writing the current time to disk on a schedule controlled by the Timestamp Interval.

If you enable this setting, the Persistent System Timestamp will be refreshed according to the Timestamp Interval.

If you disable this setting, the Persistent System Timestamp will be turned off and the timing of unexpected shutdowns will not be detected.

If you do not configure this setting, the default behavior will occur.

Note: By default, the Persistent System Timestamp is refreshed every 60 seconds beginning with Windows Server 2003.  This feature may interfere with power configuration settings that turn off hard disks after a period of inactivity.  These power settings may be accessed in the Power Options Control Panel.</string>
      <string id="PCH_ReportShutdownEvents">Report unplanned shutdown events</string>
      <string id="PCH_ReportShutdownEvents_Help">This setting controls whether or not unplanned shutdown events can be reported when error reporting is enabled.

When this setting is enabled, error reporting will include unplanned shutdown events.

When this setting is disabled, unplanned shutdown events will not be included in error reporting.

If you do not configure this setting, the user will be able to adjust this setting via the control panel, which is set to 'upload unplanned shutdown events' by default.

Also see the 'Configure Error Reporting' setting.</string>
      <string id="ShutdownEventTrackerStateFile">Activate Shutdown Event Tracker System State Data feature</string>
      <string id="ShutdownEventTrackerStateFile_Help">Defines when the Shutdown Event Tracker System State Data feature is activated.

The system state data file contains information about the basic system state as well as the state of all running processes.

If you enable this setting, the System State Data feature is activated when the user indicates that the shutdown or restart is unplanned.

If you disable this setting, the System State Data feature is never activated.

If you do not configure this setting, the default behavior for the System State Data feature occurs.

Note: By default, the System State Data feature is always enabled on the Windows Server 2003 family.</string>
      <string id="ShutdownReason">Display Shutdown Event Tracker</string>
      <string id="ShutdownReason_Always">Always</string>
      <string id="ShutdownReason_Help">The Shutdown Event Tracker can be displayed when you shut down a workstation or server.  This is an extra set of questions that is displayed when you invoke a shutdown to collect information related to why you are shutting down the computer.

If you enable this setting and choose "Always" from the drop-down menu, the Shutdown Event Tracker is displayed when you shut down.

If you enable this setting and choose "Server Only" from the drop-down menu, the Shutdown Event Tracker is displayed when you shut down a Windows Server computer beginning with Windows Server 2003.

If you enable this setting and choose "Workstation Only" from the drop-down menu, the Shutdown Event Tracker is displayed when you shut down a Windows workstation beginning with Windows XP Professional.

If you disable this setting, the Shutdown Event Tracker is not displayed when you shut down.

If you do not configure this setting, the default behavior for the Shutdown Event Tracker occurs.

Note: By default, the Shutdown Event Tracker is only displayed on the Windows Server family.</string>
      <string id="ShutdownReason_SrvOnly">Server Only</string>
      <string id="ShutdownReason_WkstnOnly">Workstation Only</string>
    </stringTable>
    <presentationTable>
      <presentation id="EE_EnablePersistentTimeStamp">
        <text>The setting allows you to customize how often the</text>
        <text>Persistent System Time Stamp is written to the disk.</text>
        <text>The range is 1 to 86400 seconds (1 day).</text>
        <decimalTextBox refId="EE_EnablePersistentTimeStamp_Desc4" defaultValue="60">Seconds: </decimalTextBox>
      </presentation>
      <presentation id="ShutdownReason">
        <dropdownList refId="ShutdownReason_Box" defaultItem="0">Shutdown Event Tracker should be displayed:</dropdownList>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
