<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="HideSCABattery">Remove the battery meter</string>
      <string id="HideSCABattery_Help"> Prevents the battery meter in the system control area from being displayed. If you enable this setting, the battery meter will not be displayed in the system notification area.

If you disable or do not configure this setting, the battery meter will be displayed in the system notification area.</string>
      <string id="HideSCANetwork">Remove the networking icon</string>
      <string id="HideSCANetwork_Help"> Prevents the networking icon in the system control area from being displayed. If you enable this setting, the networking icon will not be displayed in the system notification area.

If you disable or do not configure this setting, the networking icon will be displayed in the system notification area.</string>
      <string id="HideSCAVolume">Remove the volume control icon</string>
      <string id="HideSCAVolume_Help"> Prevents the volume control icon in the system control area from being displayed. If you enable this setting, the volume control icon will not be displayed in the system notification area.

If you disable or do not configure this setting, the volume control icon will be displayed in the system notification area.</string>

      <string id="HideSCAHealth">Remove the Action Center icon</string>
      <string id="HideSCAHealth_Help"> Prevents the Action Center in the system control area from being displayed. If you enable this setting, the Action Center icon will not be displayed in the system notification area.

If you disable or do not configure this setting, the Action Center icon will be displayed in the system notification area.</string>
      <string id="TaskbarLockAll">Lock all taskbar settings</string>
      <string id="TaskbarLockAll_Help">Prevents the user from making any changes to the taskbar settings through the Taskbar Properties dialog.

If you enable this setting the user cannot access the taskbar control panel. The user is also unable to resize, move or rearrange toolbars on their taskbar.

If you disable or do not configure this setting the user will be able to set any taskbar setting that is not disallowed by another policy setting.</string>
      <string id="TaskbarNoAddRemoveToolbar">Prevent users from adding or removing toolbars</string>
      <string id="TaskbarNoAddRemoveToolbar_Help">Prevents users from adding or removing toolbars.

If you enable this policy setting the user will not be allowed to add or remove any toolbars to the taskbar. Applications will not be able to add toolbars either.

If you disable or do not configure this policy setting, the users and applications will be able to add toolbars to the taskbar.</string>
      <string id="TaskbarNoDragToolbar">Prevent users from rearranging toolbars</string>
      <string id="TaskbarNoDragToolbar_Help">Prevents users from rearranging toolbars.

If you enable this setting the user will not be able to drag or drop toolbars to the taskbar.

If you disable or do not configure this policy setting, users will be able to rearrange the toolbars on the taskbar.
</string>
      <string id="TaskbarNoNotification">Turn off all balloon notifications</string>
      <string id="TaskbarNoNotification_Help">If you enable this setting no notification balloons will be shown to the user.

If you disable or do not configure this setting balloon notifications will be displayed.</string>
      <string id="TaskbarNoRedock">Prevent users from moving taskbar to another screen dock location</string>
      <string id="TaskbarNoRedock_Help">Prevents users from moving taskbar to another screen dock location.

If you enable this policy setting the user will not be able to drag their taskbar to another side of the monitor(s).

If you disable or do not configure this policy setting the user may be able to drag their taskbar to other sides of the monitor unless disallowed by another policy setting.</string>
      <string id="TaskbarNoResize">Prevent users from resizing the taskbar</string>
      <string id="TaskbarNoResize_Help">Prevent users from resizing the taskbar.

If you enable this policy setting the user will not be able to resize their taskbar to be any other size.

If you disable or do not configure this policy setting, the user will be able to resize their taskbar to be any other size unless disallowed by another setting.</string>
      <string id="TaskbarNoThumbnail">Turn off taskbar thumbnails</string>
      <string id="TaskbarNoThumbnail_Help">If you enable this setting the taskbar thumbnails will not be shown, and the system will use standard text for the tooltips.

If you disable or do not configure this setting the user will see the taskbar thumbnails. </string>
      <string id="TaskbarNoPinnedList">Remove pinned programs from the Taskbar</string>
      <string id="TaskbarNoPinnedList_Help">If you enable this setting, pinned programs are prevented from being shown on the Taskbar. Users cannot pin programs to the Taskbar. 

If you disable this setting or do not configure it, users can pin programs so that the program shortcuts stay on the Taskbar.</string>
      <string id="NoBalloonFeatureAdvertisements">Turn off feature advertisement balloon notifications</string>
      <string id="NoBalloonFeatureAdvertisements_Help">If you enable this setting, certain notification balloons that are marked as feature advertisements will not be shown.

If you disable this setting or do not configure it, feature advertisement balloons will be shown.</string>
      <string id="NoSystraySystemPromotion">Turn off automatic promotion of notification icons to the taskbar</string>
      <string id="NoSystraySystemPromotion_Help">If you enable this setting, newly added notification icons will not be temporarily promoted to the Taskbar. Users can still configure icons to be shown or hidden in the Notification Control Panel.

If you disable this setting or do not configure it, newly added notification icons will sometimes be temporarily promoted to the Taskbar.</string>
      <string id="NoRemoteDestinations">Do not display or track items in Jump Lists from remote locations</string>
      <string id="NoRemoteDestinations_Help">The Start Menu and Taskbar display Jump Lists off of programs. These menus include files, folders, websites and other relevant items for that program. This helps users more easily reopen their most important documents and other tasks.

If you disable or do not configure this setting, all files that the user opens will appear in the menus, including files located remotely on another computer.

If you enable this setting, the Start Menu and Taskbar will only track the files that the user opens locally on this computer. Files that the user opens over the network from remote computers will not be tracked or shown in the Jump Lists. Use this setting to reduce network traffic, particularly over slow network connections.

Note: This setting does not prevent Windows from displaying remote files that the user has explicitly pinned to the Jump Lists. See the "Do not allow pinning items in Jump Lists" setting.</string>
      <string id="NoPinningToTaskbar">Do not allow pinning programs to the Taskbar</string>
      <string id="NoPinningToTaskbar_Help">If you enable this setting, users cannot change the programs currently pinned to the Taskbar. If any programs are already pinned to their Taskbar, these programs will continue to show in the Taskbar. However, users cannot unpin these programs already pinned to the Taskbar, and they cannot pin new programs to the Taskbar.

If you disable this setting or do not configure it, users can pin programs so that the program shortcuts stay on the Taskbar.</string>
      <string id="NoPinningToDestinations">Do not allow pinning items in Jump Lists</string>
      <string id="NoPinningToDestinations_Help">If you enable this setting, users cannot pin files, folders, websites, or other items to their Jump Lists in the Start Menu and Taskbar. Users also cannot unpin existing items pinned to their Jump Lists. Existing items already pinned to their Jump Lists will continue to show.

If you disable this setting or do not configure it, users can pin files, folders, websites, and other items to a program's Jump List so that the items is always present in this menu.</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
