<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="DisableThumbnails">Turn off the display of thumbnails and only display icons.</string>
      <string id="DisableThumbnails_Help">Disables the display of thumbnails in Windows Explorer.

Windows Explorer displays thumbnails by default.

If you enable this policy setting, Windows Explorer will only display icons and never display thumbnails.</string>
      <string id="DisableThumbnailsOnNetworkFolders">Turn off the display of thumbnails and only display icons on network folders</string>
      <string id="DisableThumbnailsOnNetworkFolders_Help">Disables the display of thumbnails on network folders in Windows Explorer.

Windows Explorer displays thumbnails on network folders by default.

If you enable this policy, Windows Explorer will only display icons and never display thumbnails on network folders.</string>
      <string id="DisableThumbsDBOnNetworkFolders">Turn off the caching of thumbnails in hidden thumbs.db files</string>
      <string id="DisableThumbsDBOnNetworkFolders_Help">Turns off the caching of thumbnails in hidden thumbs.db files.

This policy setting allows you to configure Windows Explorer to cache thumbnails of items residing in network folders in hidden thumbs.db files.

If you enable this policy setting, Windows Explorer does not create, read from, or write to thumbs.db files.

If you disable or do not configure this policy setting, Windows Explorer creates, reads from, and writes to thumbs.db files.
</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
