<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="AntiSpyware">Windows Defender</string>
      <string id="CheckForSignaturesBeforeRunningScan">Check for New Signatures Before Scheduled Scans</string>
      <string id="CheckForSignaturesBeforeRunningScan_Explain">Checks for new signatures before running scheduled scans.

If you enable this policy setting, the scheduled scan checks for new signatures before it scans the computer.

If you disable or do not configure this policy setting, the scheduled scan begins without downloading new signatures.</string>
      <string id="DisableAntiSpyware">Turn off Windows Defender</string>
      <string id="DisableAntiSpyware_Explain">Turns off Windows Defender Real-Time Protection, and no more scans are scheduled.

If you enable this policy setting, Windows Defender does not run, and computers will not be scanned for spyware or other potentially unwanted software.

If you disable or do not configure this policy setting, by default Windows Defender runs and computers are scanned for spyware and other potentially unwanted software.</string>
      <string id="SpyNetReporting">Configure Microsoft SpyNet Reporting</string>
      <string id="SpyNetReporting_Explain">Adjusts membership in Microsoft SpyNet. 

Microsoft SpyNet is the online community that helps you choose how to respond to potential spyware threats. The community also helps stop the spread of new spyware infections.

Here's how it works. When Windows Defender detects software or changes by software not yet classified for risks, you see how other members responded to the alert. In turn, the action you apply help other members choose how to respond. Your actions also help Microsoft choose which software to investigate for potential threats. You can choose to send basic or additional information about detected software. Additional information helps improve how Windows Defender works. It can include, for example, the location of detected items on your computer if harmful software has been removed. Windows Defender will automatically collect and send the information.

If you enable this policy setting and choose "No Membership" from the drop-down list, SpyNet membership will be disabled. At this setting, no information will be sent to Microsoft. You will not be alerted if Windows Defender detects unclassified software running on your computer. Local users will not be able to change their SpyNet membership.

If you enable this policy setting and choose "Basic" from the drop-down list, SpyNet membership is set to "Basic". At this setting, basic information about the detected items and the actions you apply will be shared with the online community. You will not be alerted if Windows Defender detects software that has not yet been classified for risks.

If you enable this policy setting and choose "Advanced" from the drop-down list, SpyNet membership is set to "Advanced". At this setting, you send your choices and additional information about detected items. You are alerted so you can take action when Windows Defender detects changes to your computer by unclassified software. Your decisions to allow or block changes help Microsoft create new definitions for Windows Defender and better detect harmful software. In some instances, personal information may be sent but no information is used to contact you.

If you disable or do not configure this policy setting, by default SpyNet membership is disabled. At this setting, no information will be sent to Microsoft. You will not be alerted if Windows Defender detects unclassified software running on your computer. Local users will still be able to change their SpyNet membership.</string>
      <string id="SpyNetReporting_Disabled">No Membership</string>
      <string id="SpyNetReporting_Basic">Basic</string>
      <string id="SpyNetReporting_Advanced">Advanced</string>
			
      <string id="CheckAlternateDownloadLocation">Turn on definition updates through both WSUS and Windows Update</string>
      <string id="CheckAlternateDownloadLocation_Explain">This policy setting allows you to configure Windows Defender to check and install definition updates from Windows Update when a locally managed Windows Server Update Services (WSUS) server is not available.
      
Windows Defender checks for definition updates using the Automatic Updates client. The Automatic Updates client can be configured to check the public Windows Update Web site or a locally managed WSUS server. When a computer is not able to connect to an internal WSUS server, such as when a portable computer is roaming outside of the corporate network, Windows Defender can be configured to also check Windows Update to ensure definition updates are delivered to these roaming machines.
      
If you enable or do not configure this policy setting, by default Windows Defender will check for definition updates from Windows Update, if connections to a locally managed WSUS server fail.
      
If you disable this policy setting, Windows Defender will check for definition updates only on a locally managed WSUS server, if the Automatic Updates client is so configured.</string>

      <string id="CheckAlternateHttpLocation">Turn on definition updates through both WSUS and the Microsoft Malware Protection Center</string>
      <string id="CheckAlternateHttpLocation_Explain">This policy setting allows you to configure Windows Defender to check and install definition updates from Windows Update the Microsoft Malware Protection Center when a locally managed Windows Server Update Services (WSUS) server is not available.
     
Windows Defender checks for definition updates using the Automatic Updates client. The Automatic Updates client can be configured to check the public Windows Update Web site, a locally managed WSUS server or the Microsoft Malware Protection Center. When a computer is not able to connect to an internal WSUS server or the locally managed WSUS server, such as when a portable computer is roaming outside of the corporate network, Windows Defender can be configured to also check the Microsoft Malware Protection Center Windows Update to ensure definition updates are delivered to these roaming machines.
      
If you enable or do not configure this policy setting, by default Windows Defender will check for definition updates from Windows Update the Microsoft Malware Protection Center, if connections to a locally managed WSUS server fail.
      
If you disable this policy setting, Windows Defender will check for definition updates only on a locally managed WSUS server, if the Automatic Updates client is so configured.</string>

      <string id="DisableRealtimeMonitoring">Turn off Real-Time Monitoring</string>
      <string id="DisableRealtimeMonitoring_Explain">Turns off Real-Time Protection prompts for known malware detection.

Windows Defender alerts you when spyware or potentially unwanted software attempts to install itself or to run on your computer.

If you enable this policy setting, Windows Defender will not prompt users to take actions on malware detections.

If you disable or do not configure this policy setting, Windows Defender will prompt users to take actions on malware detections.</string>

      <string id="DisableRoutinelyTakingAction">Turn off Routinely Taking Action</string>
      <string id="DisableRoutinelyTakingAction_Explain">Turns off Routinely Taking Action.

This policy setting allows you to configure whether Windows Defender will automatically take action on all detected threats. The action to be taken on a particular threat will be determined by the combination of the policy-defined action, user-defined action and the signature-defined action.

If you enable this policy setting, Windows Defender will not automatically take action on the detected threats, but will prompt users to choose from the actions available for each threat.

If you disable or do not configure this policy setting, Windows Defender will automatically take action on all detected threats after a non-configurable delay of approximately ten minutes.</string>



    </stringTable>
    <presentationTable>
      <presentation id="SpyNetReporting">
        <dropdownList refId="SpyNetReporting" noSort="true" defaultItem="0">Microsoft SpyNet Membership</dropdownList>
      </presentation>
   </presentationTable>
  </resources>
</policyDefinitionResources>
