<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions" revision="1.0" schemaVersion="1.0">
  <displayName>Windows Vista base categories and supported component definitions</displayName>
  <description>This file contains all the base categories and supported component definitions used by operating system components.</description>

  <resources>
    <stringTable>
      <string id="SUPPORTED_WindowsVistaOrServer2008Only">Windows Vista and Windows Server 2008</string>
      <string id="SUPPORTED_AllowWebPrinting">Windows 2000 or later, running IIS. Not supported on Windows Server 2003</string>
      <string id="SUPPORTED_IE6SP1">At least Internet Explorer 6 Service Pack 1</string>
      <string id="SUPPORTED_Win2k">At least Windows 2000</string>
      <string id="SUPPORTED_Win2kOnly">Windows 2000 only</string>
      <string id="SUPPORTED_Win2kSP1">At least Windows 2000 Service Pack 1</string>
      <string id="SUPPORTED_Win2kSP3">At least Windows 2000 Service Pack 3</string>
      <string id="SUPPORTED_Win2kSP3_Or_XPSP1">At least Windows 2000 Service Pack 3 or Windows XP Professional Service Pack 1</string>
      <string id="SUPPORTED_WindowsNET">At least Windows Server 2003</string>
      <string id="SUPPORTED_WindowsNETOnly">Windows Server 2003 only</string>
      <string id="SUPPORTED_WindowsNET_XP">Windows Server 2003 and Windows XP only</string>
      <string id="SUPPORTED_WindowsPreVista">Windows Server 2003, Windows XP, and Windows 2000 operating systems only</string>
      <string id="SUPPORTED_WindowsUpdate">At least Windows 2000 Service Pack 3, Windows XP Professional Service Pack 1 or Windows Server 2003 family</string>
      <string id="SUPPORTED_WindowsVista">At least Windows Vista</string>
      <string id="SUPPORTED_WindowsVistaSP1">At least Windows Vista Service Pack 1</string>
      <string id="SUPPORTED_WindowsVistaOnly">Windows Vista only</string>
      <string id="SUPPORTED_WindowsXP">At least Windows XP Professional or Windows Server 2003 family</string>
      <string id="SUPPORTED_WindowsXP_Or_Vista">Windows XP or at least Windows Vista</string>
      <string id="SUPPORTED_WindowsXP_SP1_W2K_SP4_NETSERVER">At least Windows 2000 Service Pack 4, Windows XP Professional Service Pack 1 or Windows Server 2003 family</string>
      <string id="SUPPORTED_WindowsXP_SP2_W2K_SP5_NETSERVER_SP1">At least Windows 2000 Service Pack 5, Windows XP Professional Service Pack 2 or Windows Server 2003 family Service Pack 1</string>
      <string id="SUPPORTED_WindowsXPOnly">Windows XP Professional only</string>
      <string id="SUPPORTED_WindowsXPSP1">At least Windows XP Professional with SP1 or Windows Server 2003 family</string>
      <string id="SUPPORTED_WindowsXPSP2">At least Windows XP Professional with SP2</string>
      <string id="SUPPORTED_WindowsXPSP2_Or_WindowsNET">At least Windows XP Professional with SP2 or Windows Server 2003 family</string>
      <string id="SUPPORTED_WindowsXPSP2_Or_WindowsNETSP1">At least Windows XP Professional with SP2 or Windows Server 2003 family with SP1</string>
      <string id="SUPPORTED_WindowsXPOrServerOnly">Windows Server 2003 and Windows XP operating systems only</string>
      <string id="SUPPORTED_Windows7">At least Windows 7 or Windows Server 2008 R2</string>
      <string id="SUPPORTED_WindowsVistaTo2k">Windows Server 2008, Windows Vista, Windows Server 2003, Windows XP, and Windows 2000</string>
      <string id="SUPPORTED_WindowsVistaToXP">Windows Server 2008, Windows Vista, Windows Server 2003, and Windows XP</string>
      <string id="SUPPORTED_WindowsVistaToXPSP2">Windows Server 2008, Windows Vista, Windows Server 2003, and Windows XP SP2</string>
      <string id="System">System</string>
      <string id="System_Help">Allows configuration of various system component settings.</string>
      <string id="InternetManagement">Internet Communication Management</string>
      <string id="InternetManagement_Settings">Internet Communication settings</string>
      <string id="Troubleshooting">Troubleshooting and Diagnostics</string>
      <string id="WindowsComponents">Windows Components</string>
      <string id="WindowsComponents_Help">Contains settings for operating system components.</string>
      <string id="WindowsExplorer">Windows Explorer</string>
      <string id="WindowsExplorer_Help">Manages Windows Explorer settings. These include shell properties, folder options, file menus, and available drives.</string>
      <string id="TabletPC">Tablet PC</string>
      <string id="Network">Network</string>
      <string id="Network_Help">Allows configuration of components of the operating system used by a client computer to connect to a network. This includes DNS settings and Offline Files.</string>
      <string id="SharedFolders">Shared Folders</string>
      <string id="SharedFolders_Help">Manages configuration and behavior of shared folders.</string>
      <string id="Printers">Printers</string>
      <string id="Printers_Help">Manages network printer configuration and publishing options.</string>
      <string id="StartMenu">Start Menu and Taskbar</string>
      <string id="StartMenu_Help">Contains settings that allow you to add, remove, or disable items from the Start menu, taskbar, and notification area.</string>
      <string id="ControlPanel">Control Panel</string>
      <string id="ControlPanel_Help">Contains settings to allow configuration of the Control Panel, including the items that it does or does not display.</string>
      <string id="Desktop">Desktop</string>
      <string id="Desktop_Help">Contains settings to manage behavior of the user's desktop, as well as which default icons are displayed on that desktop.</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
