<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="wuau" namespace="Microsoft.Policies.WindowsUpdate" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <supersededAdm fileName="wuau.adm" />
  <resources minRequiredRevision="1.0" />
  <supportedOn>
    <!--
      For product definitions (products:MicrosoftABC) please consult:
      //depot/winmain/ds/grouppolicy/PolicyDefinitions/WindowsProducts.admx
      
      For windows policy definitions (windows:XYZ):
      //depot/winmain/ds/grouppolicy/PolicyDefinitions/windows.admx 
      //depot/winmain/ds/grouppolicy/PolicyDefinitions/WindowsServer.admx
  -->
    <definitions>
      <!--Windows 7 or Windows 8.1-->
      <definition name="WU_SUPPORTED_Windows7_Or_Win81Update" displayName="$(string.WU_SUPPORTED_Windows7_Or_Win81Update)">
        <or>
          <reference ref="products:MicrosoftWindows7" />
          <reference ref="products:MicrosoftWindows_6_3" />
        </or>
      </definition>
    </definitions>
  </supportedOn>
  <categories>
    <category name="WindowsUpdateCat" displayName="$(string.WindowsUpdateCat)">
      <parentCategory ref="windows:WindowsComponents" />
    </category>
  </categories>
  <policies>
    <policy name="NoAutoUpdate" class="User" displayName="$(string.NoAutoUpdate)" explainText="$(string.NoAutoUpdate_Help)" key="Software\Microsoft\Windows\CurrentVersion\Policies\Explorer" valueName="NoAutoUpdate">
      <parentCategory ref="windows:System" />
      <supportedOn ref="windows:SUPPORTED_WindowsXPOnly" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="AUDontShowUasPolicy" class="Both" displayName="$(string.AUDontShowUasPolicy)" explainText="$(string.AUDontShowUasHelp)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="NoAUShutdownOption">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_WindowsXPSP2" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="AUNoUasDefaultPolicy_User" class="User" displayName="$(string.AUNoUasDefaultPolicy)" explainText="$(string.AUNoUasDefaultHelp_User)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="NoAUAsDefaultShutdownOption">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_WindowsXPSP2" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="AUNoUasDefaultPolicy_Mach" class="Machine" displayName="$(string.AUNoUasDefaultPolicy)" explainText="$(string.AUNoUasDefaultHelp_Mach)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="NoAUAsDefaultShutdownOption">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_WindowsXPSP2" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>	
    <policy name="RemoveWindowsUpdate" class="User" displayName="$(string.RemoveWindowsUpdate)" explainText="$(string.RemoveWindowsUpdate_Help)" presentation="$(presentation.RemoveWindowsUpdate)" key="Software\Microsoft\Windows\CurrentVersion\Policies\WindowsUpdate" valueName="DisableWindowsUpdateAccess">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_Win2kSP3_Or_XPSP1" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
      <elements>
        <enum id="RemoveWindowsUpdateMode" valueName="DisableWindowsUpdateAccessMode" required="true">
          <item displayName="$(string.RemoveWindowsUpdateModeAll)">
            <value>
              <decimal value="0" />
            </value>
          </item>
          <item displayName="$(string.RemoveWindowsUpdateModeReboot)">
            <value>
              <decimal value="1" />
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy name="AutoUpdateCfg" class="Machine" displayName="$(string.AutoUpdateCfg)" explainText="$(string.AutoUpdateCfg_Help)" presentation="$(presentation.AutoUpdateCfg)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="NoAutoUpdate">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_Win2kSP3_Or_XPSP1" />
      <enabledValue>
        <decimal value="0" />
      </enabledValue>
      <disabledValue>
        <decimal value="1" />
      </disabledValue>
      <elements>
        <enum id="AutoUpdateMode" valueName="AUOptions" required="true">
          <item displayName="$(string.AutoUpdateModeNotify)">
            <value>
              <decimal value="2" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateModeDownload)">
            <value>
              <decimal value="3" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateModeAuto)">
            <value>
              <decimal value="4" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateModeAdminChooses)">
            <value>
              <decimal value="5" />
            </value>
          </item>
        </enum>
        <enum id="AutoUpdateSchDay" valueName="ScheduledInstallDay" required="true">
          <item displayName="$(string.AutoUpdateSchDay_Everyday)">
            <value>
              <decimal value="0" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchDay_Sunday)">
            <value>
              <decimal value="1" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchDay_Monday)">
            <value>
              <decimal value="2" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchDay_Tuesday)">
            <value>
              <decimal value="3" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchDay_Wednesday)">
            <value>
              <decimal value="4" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchDay_Thursday)">
            <value>
              <decimal value="5" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchDay_Friday)">
            <value>
              <decimal value="6" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchDay_Saturday)">
            <value>
              <decimal value="7" />
            </value>
          </item>
        </enum>
        <enum id="AutoUpdateSchTime" valueName="ScheduledInstallTime" required="true">
          <item displayName="$(string.AutoUpdateSchTime0)">
            <value>
              <decimal value="0" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime1)">
            <value>
              <decimal value="1" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime2)">
            <value>
              <decimal value="2" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime3)">
            <value>
              <decimal value="3" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime4)">
            <value>
              <decimal value="4" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime5)">
            <value>
              <decimal value="5" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime6)">
            <value>
              <decimal value="6" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime7)">
            <value>
              <decimal value="7" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime8)">
            <value>
              <decimal value="8" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime9)">
            <value>
              <decimal value="9" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime10)">
            <value>
              <decimal value="10" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime11)">
            <value>
              <decimal value="11" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime12)">
            <value>
              <decimal value="12" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime13)">
            <value>
              <decimal value="13" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime14)">
            <value>
              <decimal value="14" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime15)">
            <value>
              <decimal value="15" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime16)">
            <value>
              <decimal value="16" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime17)">
            <value>
              <decimal value="17" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime18)">
            <value>
              <decimal value="18" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime19)">
            <value>
              <decimal value="19" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime20)">
            <value>
              <decimal value="20" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime21)">
            <value>
              <decimal value="21" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime22)">
            <value>
              <decimal value="22" />
            </value>
          </item>
          <item displayName="$(string.AutoUpdateSchTime23)">
            <value>
              <decimal value="23" />
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy name="CorpWuURL" class="Machine" displayName="$(string.CorpWuURL)" explainText="$(string.CorpWuURL_Help)" presentation="$(presentation.CorpWuURL)" key="Software\Policies\Microsoft\Windows\WindowsUpdate">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_Win2kSP3_Or_XPSP1" />
      <enabledList>
        <item key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="UseWUServer">
          <value>
            <decimal value="1" />
          </value>
        </item>
      </enabledList>
      <disabledList>
        <item key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="UseWUServer">
          <value>
            <decimal value="0" />
          </value>
        </item>
      </disabledList>
      <elements>
        <text id="CorpWUURL_Name" valueName="WUServer" required="true" />
        <text id="CorpWUStatusURL_Name" valueName="WUStatusServer" required="true" />
      </elements>
    </policy>
    <policy name="DetectionFrequency_Title" class="Machine" displayName="$(string.DetectionFrequency_Title)" explainText="$(string.DetectionFrequency_Help)" presentation="$(presentation.DetectionFrequency_Title)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="DetectionFrequencyEnabled">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_Win2kSP3_Or_XPSP1" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
      <elements>
        <decimal id="DetectionFrequency_Hour2" valueName="DetectionFrequency" required="true" minValue="1" maxValue="22" />
      </elements>
    </policy>
    <policy name="ElevateNonAdmins_Title" class="Machine" displayName="$(string.ElevateNonAdmins_Title)" explainText="$(string.ElevateNonAdmins_Help)" key="Software\Policies\Microsoft\Windows\WindowsUpdate" valueName="ElevateNonAdmins">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_Win2kSP3_Or_XPSP1" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="ImmediateInstall_Title" class="Machine" displayName="$(string.ImmediateInstall_Title)" explainText="$(string.ImmediateInstall_Help)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="AutoInstallMinorUpdates">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_Win2kSP3_Or_XPSP1" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="IncludeRecommendedUpdates_Title" class="Machine" displayName="$(string.IncludeRecommendedUpdates_Title)" explainText="$(string.IncludeRecommendedUpdates_Help)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="IncludeRecommendedUpdates">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="FeaturedSoftwareNotification_Title" class="Machine" displayName="$(string.FeaturedSoftwareNotification_Title)" explainText="$(string.FeaturedSoftwareNotification_Help)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="EnableFeaturedSoftware">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="AUPowerManagement_Title" class="Machine" displayName="$(string.AUPowerManagement_Title)" explainText="$(string.AUPowerManagement_Help)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="AUPowerManagement">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="NoAutoRebootWithLoggedOnUsers_Title" class="Machine" displayName="$(string.NoAutoRebootWithLoggedOnUsers_Title)" explainText="$(string.NoAutoRebootWithLoggedOnUsers_Help)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="NoAutoRebootWithLoggedOnUsers">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_Win2kSP3_Or_XPSP1" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="RebootRelaunchTimeout_Title" class="Machine" displayName="$(string.RebootRelaunchTimeout_Title)" explainText="$(string.RebootRelaunchTimeout_Help)" presentation="$(presentation.RebootRelaunchTimeout_Title)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="RebootRelaunchTimeoutEnabled">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_Win2kSP3_Or_XPSP1" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
      <elements>
        <decimal id="RebootRelaunchTimeout_Minutes3" valueName="RebootRelaunchTimeout" required="true" minValue="1" maxValue="1440" />
      </elements>
    </policy>
    <policy name="RebootWarningTimeout_Title" class="Machine" displayName="$(string.RebootWarningTimeout_Title)" explainText="$(string.RebootWarningTimeout_Help)" presentation="$(presentation.RebootWarningTimeout_Title)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="RebootWarningTimeoutEnabled">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_Win2kSP3_Or_XPSP1" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
      <elements>
        <decimal id="RebootWarningTimeout_Minutes3" valueName="RebootWarningTimeout" required="true" minValue="1" maxValue="30" />
      </elements>
    </policy>
    <policy name="RescheduleWaitTime_Title" class="Machine" displayName="$(string.RescheduleWaitTime_Title)" explainText="$(string.RescheduleWaitTime_Help)" presentation="$(presentation.RescheduleWaitTime_Title)" key="Software\Policies\Microsoft\Windows\WindowsUpdate\AU" valueName="RescheduleWaitTimeEnabled">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_Win2kSP3_Or_XPSP1" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
      <elements>
        <decimal id="RescheduleWaitTime_Minutes2" valueName="RescheduleWaitTime" required="true" minValue="1" maxValue="60" />
      </elements>
    </policy>
    <policy name="TargetGroup_Title" class="Machine" displayName="$(string.TargetGroup_Title)" explainText="$(string.TargetGroup_Help)" presentation="$(presentation.TargetGroup_Title)" key="Software\Policies\Microsoft\Windows\WindowsUpdate" valueName="TargetGroupEnabled">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_Win2kSP3_Or_XPSP1" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
      <elements>
        <text id="TargetGroup_Name" valueName="TargetGroup" required="true" />
      </elements>
    </policy>
    <policy name="TrustedPublisher_Title" class="Machine" displayName="$(string.TrustedPublisher_Title)" explainText="$(string.TrustedPublisher_Help)" key="Software\Policies\Microsoft\Windows\WindowsUpdate" valueName="AcceptTrustedPublisherCerts">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="windows:SUPPORTED_WindowsXPSP1" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="DisableOSUpgrade_Title" class="Machine" displayName="$(string.DisableOSUpgrade_Title)" explainText="$(string.DisableOSUpgrade_Help)" key="Software\Policies\Microsoft\Windows\WindowsUpdate" valueName="DisableOSUpgrade">
      <parentCategory ref="WindowsUpdateCat" />
      <supportedOn ref="WU_SUPPORTED_Windows7_Or_Win81Update" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
  </policies>
</policyDefinitions>
